================================================================================
Naked block
================================================================================

{
    var := 1
}

--------------------------------------------------------------------------------

(source_file
  (block
    (assignment_operation
      (identifier)
      (assignment_operator)
      (integer_literal))))

================================================================================
Block with object literal
================================================================================

{
    obj := { a: 1 }
}

--------------------------------------------------------------------------------

(source_file
  (block
    (assignment_operation
      (identifier)
      (assignment_operator)
      (object_literal
        (object_literal_member_sequence
          (object_literal_member
            (identifier)
            (integer_literal)))))))

================================================================================
Empty return statement
================================================================================

return

--------------------------------------------------------------------------------

(source_file
  (return_statement
    (return)))

================================================================================
Return with literal
================================================================================

return 1

--------------------------------------------------------------------------------

(source_file
  (return_statement
    (return)
    (integer_literal)))

================================================================================
Return with arithmetic statement
================================================================================

return 2 + 2

--------------------------------------------------------------------------------

(source_file
  (return_statement
    (return)
    (additive_operation
      (integer_literal)
      (integer_literal))))

================================================================================
Parenthesized return with literal
================================================================================

return("example")

--------------------------------------------------------------------------------

(source_file
  (return_statement
    (return)
    (expression_sequence
      (string_literal))))

================================================================================
If statement with braces
================================================================================

if (x > 5) {
    y := 10
}

--------------------------------------------------------------------------------

(source_file
  (if_statement
    (if)
    (expression_sequence
      (relational_operation
        (identifier)
        (integer_literal)))
    (block
      (assignment_operation
        (identifier)
        (assignment_operator)
        (integer_literal)))))

================================================================================
If-else statement
================================================================================

if (x > 5) {
    y := 10
} else {
    y := 0
}

--------------------------------------------------------------------------------

(source_file
  (if_statement
    (if)
    (expression_sequence
      (relational_operation
        (identifier)
        (integer_literal)))
    (block
      (assignment_operation
        (identifier)
        (assignment_operator)
        (integer_literal)))
    (else_statement
      (else)
      (block
        (assignment_operation
          (identifier)
          (assignment_operator)
          (integer_literal))))))

================================================================================
If-else-if chain
================================================================================

if (x > 10) {
    y := 1
} else if (x > 5) {
    y := 2
} else {
    y := 3
}

--------------------------------------------------------------------------------

(source_file
  (if_statement
    (if)
    (expression_sequence
      (relational_operation
        (identifier)
        (integer_literal)))
    (block
      (assignment_operation
        (identifier)
        (assignment_operator)
        (integer_literal)))
    (else_statement
      (else)
      (if_statement
        (if)
        (expression_sequence
          (relational_operation
            (identifier)
            (integer_literal)))
        (block
          (assignment_operation
            (identifier)
            (assignment_operator)
            (integer_literal)))
        (else_statement
          (else)
          (block
            (assignment_operation
              (identifier)
              (assignment_operator)
              (integer_literal))))))))

================================================================================
While loop
================================================================================

while (i < 10) {
    i++
}

--------------------------------------------------------------------------------

(source_file
  (while_statement
    (while)
    (relational_operation
      (identifier)
      (integer_literal))
    (block
      (postfix_operation
        (identifier)))))

================================================================================
Loop with count
================================================================================

loop 5 {
    x++
}

--------------------------------------------------------------------------------

(source_file
  (loop_statement
    (loop)
    (integer_literal)
    (block
      (postfix_operation
        (identifier)))))

================================================================================
Parenthesized loop with count
================================================================================

loop (5) {
    x++
}

--------------------------------------------------------------------------------

(source_file
  (loop_statement
    (loop)
    (integer_literal)
    (block
      (postfix_operation
        (identifier)))))

================================================================================
Loop with break
================================================================================

loop {
    if (x > 10) {
        break
    }
}

--------------------------------------------------------------------------------

(source_file
  (loop_statement
    (loop)
    (block
      (if_statement
        (if)
        (expression_sequence
          (relational_operation
            (identifier)
            (integer_literal)))
        (block
          (break_statement
            (break)))))))

================================================================================
Loop with continue
================================================================================

loop 10 {
    if (i == 5) {
        continue
    }
    x += i
}

--------------------------------------------------------------------------------

(source_file
  (loop_statement
    (loop)
    (integer_literal)
    (block
      (if_statement
        (if)
        (expression_sequence
          (equality_operation
            (identifier)
            (integer_literal)))
        (block
          (continue_statement
            (continue))))
      (assignment_operation
        (identifier)
        (assignment_operator)
        (identifier)))))

================================================================================
Throw statement
================================================================================

throw Error("Invalid value")

--------------------------------------------------------------------------------

(source_file
  (throw_statement
    (throw)
    (function_call
      (identifier)
      (arg_sequence
        (string_literal)))))

================================================================================
Throw with parentheses
================================================================================

throw(Error("Invalid value"))

--------------------------------------------------------------------------------

(source_file
  (throw_statement
    (throw)
    (expression_sequence
      (function_call
        (identifier)
        (arg_sequence
          (string_literal))))))

================================================================================
Goto and label
================================================================================

goto MyLabel
x := 1
MyLabel:
y := 2

--------------------------------------------------------------------------------

(source_file
  (goto_statement
    (goto)
    (identifier))
  (assignment_operation
    (identifier)
    (assignment_operator)
    (integer_literal))
  (label
    (identifier))
  (assignment_operation
    (identifier)
    (assignment_operator)
    (integer_literal)))

================================================================================
Parenthesized goto and label
================================================================================

goto(MyLabel)
x := 1
MyLabel:
y := 2

--------------------------------------------------------------------------------

(source_file
  (goto_statement
    (goto)
    (expression_sequence
      (identifier)))
  (assignment_operation
    (identifier)
    (assignment_operator)
    (integer_literal))
  (label
    (identifier))
  (assignment_operation
    (identifier)
    (assignment_operator)
    (integer_literal)))

================================================================================
Parenthesized goto with expression and label
================================================================================

goto("var")
x := 1
MyLabel:
y := 2

--------------------------------------------------------------------------------

(source_file
  (goto_statement
    (goto)
    (expression_sequence
      (string_literal)))
  (assignment_operation
    (identifier)
    (assignment_operator)
    (integer_literal))
  (label
    (identifier))
  (assignment_operation
    (identifier)
    (assignment_operator)
    (integer_literal)))

================================================================================
Break with label
================================================================================

outer:
loop 10 {
    loop 5 {
        if (done) {
            break outer
        }
    }
}

--------------------------------------------------------------------------------

(source_file
  (label
    (identifier))
  (loop_statement
    (loop)
    (integer_literal)
    (block
      (loop_statement
        (loop)
        (integer_literal)
        (block
          (if_statement
            (if)
            (expression_sequence
              (identifier))
            (block
              (break_statement
                (break)
                (identifier)))))))))

================================================================================
For loop single variable
================================================================================

for value in collection {
    total += value
}

--------------------------------------------------------------------------------

(source_file
  (for_statement
    (for)
    (identifier)
    (in)
    (identifier)
    (block
      (assignment_operation
        (identifier)
        (assignment_operator)
        (identifier)))))

================================================================================
For-else statement
================================================================================

for value in collection {
    total += value
}
else {
    empty := true
}

--------------------------------------------------------------------------------

(source_file
  (for_statement
    (for)
    (identifier)
    (in)
    (identifier)
    (block
      (assignment_operation
        (identifier)
        (assignment_operator)
        (identifier)))
    (else_statement
      (else)
      (block
        (assignment_operation
          (identifier)
          (assignment_operator)
          (boolean_literal))))))

================================================================================
Parenthesized for loop single variable
================================================================================

for (value in collection) {
    total += value
}

--------------------------------------------------------------------------------

(source_file
  (for_statement
    (for)
    (identifier)
    (in)
    (identifier)
    (block
      (assignment_operation
        (identifier)
        (assignment_operator)
        (identifier)))))

================================================================================
For loop key-value pair
================================================================================

for key, value in object {
    result[key] := value
}

--------------------------------------------------------------------------------

(source_file
  (for_statement
    (for)
    (identifier)
    (identifier)
    (in)
    (identifier)
    (block
      (assignment_operation
        (index_access
          (identifier)
          (arg_sequence
            (identifier)))
        (assignment_operator)
        (identifier)))))

================================================================================
For loop key-value pair parenthesized
================================================================================

for (key, value in object) {
    result[key] := value
}

--------------------------------------------------------------------------------

(source_file
  (for_statement
    (for)
    (identifier)
    (identifier)
    (in)
    (identifier)
    (block
      (assignment_operation
        (index_access
          (identifier)
          (arg_sequence
            (identifier)))
        (assignment_operator)
        (identifier)))))

================================================================================
Try-catch
================================================================================

try {
    result := x / y
} catch Error as err {
    result := 0
}

--------------------------------------------------------------------------------

(source_file
  (try_statement
    (try)
    (block
      (assignment_operation
        (identifier)
        (assignment_operator)
        (multiplicative_operation
          (identifier)
          (identifier))))
    (catch_clause
      (catch)
      (identifier)
      (as)
      (identifier)
      (block
        (assignment_operation
          (identifier)
          (assignment_operator)
          (integer_literal))))))

================================================================================
Naked try
================================================================================

try x := 1 / 0

--------------------------------------------------------------------------------

(source_file
  (try_statement
    (try)
    (assignment_operation
      (identifier)
      (assignment_operator)
      (multiplicative_operation
        (integer_literal)
        (integer_literal)))))

================================================================================
Try-catch with parenthesized catch
================================================================================

try {
    result := x / y
} catch (Error as err) {
    result := 0
}

--------------------------------------------------------------------------------

(source_file
  (try_statement
    (try)
    (block
      (assignment_operation
        (identifier)
        (assignment_operator)
        (multiplicative_operation
          (identifier)
          (identifier))))
    (catch_clause
      (catch)
      (identifier)
      (as)
      (identifier)
      (block
        (assignment_operation
          (identifier)
          (assignment_operator)
          (integer_literal))))))

================================================================================
Try-finally
================================================================================

try {
    x := 1
} finally {
    y := 2
}

--------------------------------------------------------------------------------

(source_file
  (try_statement
    (try)
    (block
      (assignment_operation
        (identifier)
        (assignment_operator)
        (integer_literal)))
    (finally_clause
      (finally)
      (block
        (assignment_operation
          (identifier)
          (assignment_operator)
          (integer_literal))))))

================================================================================
Try-catch-finally
================================================================================

try {
    x := 1 / 0
} catch {
    x := 0
} finally {
    cleanup := true
}

--------------------------------------------------------------------------------

(source_file
  (try_statement
    (try)
    (block
      (assignment_operation
        (identifier)
        (assignment_operator)
        (multiplicative_operation
          (integer_literal)
          (integer_literal))))
    (catch_clause
      (catch)
      (block
        (assignment_operation
          (identifier)
          (assignment_operator)
          (integer_literal))))
    (finally_clause
      (finally)
      (block
        (assignment_operation
          (identifier)
          (assignment_operator)
          (boolean_literal))))))

================================================================================
Try-catch-else-finally
================================================================================

try {
    x := 1/0
} catch Error as err {
    x := 0
} else {
    cleanup := false
} finally {
    cleanup := true
}

--------------------------------------------------------------------------------

(source_file
  (try_statement
    (try)
    (block
      (assignment_operation
        (identifier)
        (assignment_operator)
        (multiplicative_operation
          (integer_literal)
          (integer_literal))))
    (catch_clause
      (catch)
      (identifier)
      (as)
      (identifier)
      (block
        (assignment_operation
          (identifier)
          (assignment_operator)
          (integer_literal))))
    (else_statement
      (else)
      (block
        (assignment_operation
          (identifier)
          (assignment_operator)
          (boolean_literal))))
    (finally_clause
      (finally)
      (block
        (assignment_operation
          (identifier)
          (assignment_operator)
          (boolean_literal))))))

================================================================================
Switch statement
================================================================================

switch value {
    case 1:
        result := "one"
    case 2:
        result := "two"
    default:
        result := "other"
}

--------------------------------------------------------------------------------

(source_file
  (switch_statement
    (switch)
    (identifier)
    (switch_body
      (case_clause
        (case)
        (integer_literal)
        (assignment_operation
          (identifier)
          (assignment_operator)
          (string_literal)))
      (case_clause
        (case)
        (integer_literal)
        (assignment_operation
          (identifier)
          (assignment_operator)
          (string_literal)))
      (default_clause
        (default)
        (assignment_operation
          (identifier)
          (assignment_operator)
          (string_literal))))))

================================================================================
Switch statement with parentheses
================================================================================

switch (value) {
    case 1:
        result := "one"
    case 2:
        result := "two"
    default:
        result := "other"
}

--------------------------------------------------------------------------------

(source_file
  (switch_statement
    (switch)
    (expression_sequence
      (identifier))
    (switch_body
      (case_clause
        (case)
        (integer_literal)
        (assignment_operation
          (identifier)
          (assignment_operator)
          (string_literal)))
      (case_clause
        (case)
        (integer_literal)
        (assignment_operation
          (identifier)
          (assignment_operator)
          (string_literal)))
      (default_clause
        (default)
        (assignment_operation
          (identifier)
          (assignment_operator)
          (string_literal))))))

================================================================================
Switch with multiple case values
================================================================================

switch day {
    case "Mon", "Tue", "Wed":
        type := "weekday"
    case "Sat", "Sun":
        type := "weekend"
}

--------------------------------------------------------------------------------

(source_file
  (switch_statement
    (switch)
    (identifier)
    (switch_body
      (case_clause
        (case)
        (string_literal)
        (string_literal)
        (string_literal)
        (assignment_operation
          (identifier)
          (assignment_operator)
          (string_literal)))
      (case_clause
        (case)
        (string_literal)
        (string_literal)
        (assignment_operation
          (identifier)
          (assignment_operator)
          (string_literal))))))

================================================================================
Switch with expressions
================================================================================

switch (true) {
    case (variable < 10):
        return variable
}

--------------------------------------------------------------------------------

(source_file
  (switch_statement
    (switch)
    (expression_sequence
      (boolean_literal))
    (switch_body
      (case_clause
        (case)
        (expression_sequence
          (relational_operation
            (identifier)
            (integer_literal)))
        (return_statement
          (return)
          (identifier))))))

================================================================================
Nested if statements
================================================================================

if (x > 0) {
    if (y > 0) {
        quadrant := 1
    } else {
        quadrant := 4
    }
}

--------------------------------------------------------------------------------

(source_file
  (if_statement
    (if)
    (expression_sequence
      (relational_operation
        (identifier)
        (integer_literal)))
    (block
      (if_statement
        (if)
        (expression_sequence
          (relational_operation
            (identifier)
            (integer_literal)))
        (block
          (assignment_operation
            (identifier)
            (assignment_operator)
            (integer_literal)))
        (else_statement
          (else)
          (block
            (assignment_operation
              (identifier)
              (assignment_operator)
              (integer_literal))))))))

================================================================================
If inside loop
================================================================================

loop 10 {
    if (A_Index == 5) {
        continue
    }
    sum += A_Index
}

--------------------------------------------------------------------------------

(source_file
  (loop_statement
    (loop)
    (integer_literal)
    (block
      (if_statement
        (if)
        (expression_sequence
          (equality_operation
            (identifier)
            (integer_literal)))
        (block
          (continue_statement
            (continue))))
      (assignment_operation
        (identifier)
        (assignment_operator)
        (identifier)))))

================================================================================
Loop inside if
================================================================================

if (processAll) {
    loop 5 {
        x++
    }
}

--------------------------------------------------------------------------------

(source_file
  (if_statement
    (if)
    (expression_sequence
      (identifier))
    (block
      (loop_statement
        (loop)
        (integer_literal)
        (block
          (postfix_operation
            (identifier)))))))

================================================================================
Three-level nesting
================================================================================

while (running) {
    for item in collection {
        if (item > 0) {
            sum += item
        }
    }
}

--------------------------------------------------------------------------------

(source_file
  (while_statement
    (while)
    (identifier)
    (block
      (for_statement
        (for)
        (identifier)
        (in)
        (identifier)
        (block
          (if_statement
            (if)
            (expression_sequence
              (relational_operation
                (identifier)
                (integer_literal)))
            (block
              (assignment_operation
                (identifier)
                (assignment_operator)
                (identifier)))))))))

================================================================================
Loop parse
================================================================================

loop parse content, "`n" {
    lines++
}

--------------------------------------------------------------------------------

(source_file
  (loop_statement
    (loop)
    (parse)
    (identifier)
    (string_literal)
    (block
      (postfix_operation
        (identifier)))))

================================================================================
Loop files
================================================================================

loop files "*.txt" {
    count++
}

--------------------------------------------------------------------------------

(source_file
  (loop_statement
    (loop)
    (files)
    (string_literal)
    (block
      (postfix_operation
        (identifier)))))

================================================================================
Loop read
================================================================================

loop read "input.txt" {
    total++
}

--------------------------------------------------------------------------------

(source_file
  (loop_statement
    (loop)
    (read)
    (string_literal)
    (block
      (postfix_operation
        (identifier)))))

================================================================================
Loop until
================================================================================

loop {
    x++
} until x > 10

--------------------------------------------------------------------------------

(source_file
  (loop_statement
    (loop)
    (block
      (postfix_operation
        (identifier)))
    (until_statement
      (until)
      (relational_operation
        (identifier)
        (integer_literal)))))

================================================================================
Loop until with parentheses
================================================================================

loop {
    x++
} 
until (x > 10)

--------------------------------------------------------------------------------

(source_file
  (loop_statement
    (loop)
    (block
      (postfix_operation
        (identifier)))
    (until_statement
      (until)
      (expression_sequence
        (relational_operation
          (identifier)
          (integer_literal))))))

================================================================================
If without braces (single statement)
================================================================================

if (x > 5)
    y := 10

--------------------------------------------------------------------------------

(source_file
  (if_statement
    (if)
    (expression_sequence
      (relational_operation
        (identifier)
        (integer_literal)))
    (assignment_operation
      (identifier)
      (assignment_operator)
      (integer_literal))))

================================================================================
While without braces
================================================================================

while (i < 10)
    i++

--------------------------------------------------------------------------------

(source_file
  (while_statement
    (while)
    (relational_operation
      (identifier)
      (integer_literal))
    (postfix_operation
      (identifier))))

================================================================================
For without braces
================================================================================

for v in arr
    sum += v

--------------------------------------------------------------------------------

(source_file
  (for_statement
    (for)
    (identifier)
    (in)
    (identifier)
    (assignment_operation
      (identifier)
      (assignment_operator)
      (identifier))))

================================================================================
Empty blocks
================================================================================

if (x) { }
while (y) { }
loop 5 { }

--------------------------------------------------------------------------------

(source_file
  (if_statement
    (if)
    (expression_sequence
      (identifier))
    (block))
  (while_statement
    (while)
    (identifier)
    (block))
  (loop_statement
    (loop)
    (integer_literal)
    (block)))

================================================================================
If without parentheses
================================================================================

if x > 5 {
    y := 10
}

--------------------------------------------------------------------------------

(source_file
  (if_statement
    (if)
    (relational_operation
      (identifier)
      (integer_literal))
    (block
      (assignment_operation
        (identifier)
        (assignment_operator)
        (integer_literal)))))

================================================================================
Nested switch
================================================================================

switch type {
    case "number":
        switch value {
            case 0:
                result := "zero"
            default:
                result := "non-zero"
        }
}

--------------------------------------------------------------------------------

(source_file
  (switch_statement
    (switch)
    (identifier)
    (switch_body
      (case_clause
        (case)
        (string_literal)
        (switch_statement
          (switch)
          (identifier)
          (switch_body
            (case_clause
              (case)
              (integer_literal)
              (assignment_operation
                (identifier)
                (assignment_operator)
                (string_literal)))
            (default_clause
              (default)
              (assignment_operation
                (identifier)
                (assignment_operator)
                (string_literal)))))))))

================================================================================
If with parentheses and block body
================================================================================

if(outCtrlHwnd == "") {
    MsgBox("Clicked window but not a control")
    return 1 ; Prevent further processing
}

--------------------------------------------------------------------------------

(source_file
  (if_statement
    (if)
    (expression_sequence
      (equality_operation
        (identifier)
        (string_literal)))
    (block
      (function_call
        (identifier)
        (arg_sequence
          (string_literal)))
      (return_statement
        (return)
        (integer_literal))
      (line_comment))))

================================================================================
Loop with member access head
================================================================================

loop foo.bar {
    baz := 1
}

--------------------------------------------------------------------------------

(source_file
  (loop_statement
    (loop)
    (member_access
      (identifier)
      (identifier))
    (block
      (assignment_operation
        (identifier)
        (assignment_operator)
        (integer_literal)))))

================================================================================
Loop with function call head
================================================================================

loop foo() {
    baz := 1
}

--------------------------------------------------------------------------------

(source_file
  (loop_statement
    (loop)
    (function_call
      (identifier))
    (block
      (assignment_operation
        (identifier)
        (assignment_operator)
        (integer_literal)))))

================================================================================
Loop with method call head
================================================================================

loop foo.bar() {
    baz := 1
}

--------------------------------------------------------------------------------

(source_file
  (loop_statement
    (loop)
    (function_call
      (member_access
        (identifier)
        (identifier)))
    (block
      (assignment_operation
        (identifier)
        (assignment_operator)
        (integer_literal)))))

================================================================================
Loop with member access head and bare statement body
================================================================================

loop foo.bar 
    baz += A_Index

--------------------------------------------------------------------------------

(source_file
  (loop_statement
    (loop)
    (member_access
      (identifier)
      (identifier))
    (assignment_operation
      (identifier)
      (assignment_operator)
      (identifier))))

================================================================================
Loop with function call head and bare statement body
================================================================================

loop foo()
    bar += A_Index

--------------------------------------------------------------------------------

(source_file
  (loop_statement
    (loop)
    (function_call
      (identifier))
    (assignment_operation
      (identifier)
      (assignment_operator)
      (identifier))))

================================================================================
Loop with method call head and bare statement body
================================================================================

loop foo.bar()
    baz += A_Index

--------------------------------------------------------------------------------

(source_file
  (loop_statement
    (loop)
    (function_call
      (member_access
        (identifier)
        (identifier)))
    (assignment_operation
      (identifier)
      (assignment_operator)
      (identifier))))
