================================================================================
Single line expression sequence
================================================================================

one := 1, two := 2

--------------------------------------------------------------------------------

(source_file
  (expression_sequence
    (assignment_operation
      (identifier)
      (assignment_operator)
      (integer_literal))
    (assignment_operation
      (identifier)
      (assignment_operator)
      (integer_literal))))

================================================================================
Single line expression sequence with scope modifier
================================================================================

local one := 1, two := 2

--------------------------------------------------------------------------------

(source_file
  (expression_sequence
    (assignment_operation
      (variable_declaration
        (scope_identifier)
        (identifier))
      (assignment_operator)
      (integer_literal))
    (assignment_operation
      (identifier)
      (assignment_operator)
      (integer_literal))))

================================================================================
Parenthesized expression sequence as assignment
================================================================================

var := (one := 1, one)

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (expression_sequence
      (assignment_operation
        (identifier)
        (assignment_operator)
        (integer_literal))
      (identifier))))

================================================================================
Multiline parenthesized expression sequence as assignment
================================================================================

var := (
    one := 1, 
    two += 2)

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (expression_sequence
      (assignment_operation
        (identifier)
        (assignment_operator)
        (integer_literal))
      (assignment_operation
        (identifier)
        (assignment_operator)
        (integer_literal)))))

================================================================================
Parenthesized expression sequence with math
================================================================================

var := (two := 2, two + two)

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (expression_sequence
      (assignment_operation
        (identifier)
        (assignment_operator)
        (integer_literal))
      (additive_operation
        (identifier)
        (identifier)))))

================================================================================
Expression sequence as math operand
================================================================================

2 + (one := 1, two := 2, one + two)

--------------------------------------------------------------------------------

(source_file
  (additive_operation
    (integer_literal)
    (expression_sequence
      (assignment_operation
        (identifier)
        (assignment_operator)
        (integer_literal))
      (assignment_operation
        (identifier)
        (assignment_operator)
        (integer_literal))
      (additive_operation
        (identifier)
        (identifier)))))
