================================================================================
Simple expression sequence
================================================================================

x := 1, y := 2

--------------------------------------------------------------------------------

(source_file
  (expression_sequence
    (assignment_operation
      (identifier)
      (assignment_operator)
      (integer_literal))
    (assignment_operation
      (identifier)
      (assignment_operator)
      (integer_literal))))

================================================================================
Expression sequence with three items
================================================================================

a := 1, b := 2, c := 3

--------------------------------------------------------------------------------

(source_file
  (expression_sequence
    (assignment_operation
      (identifier)
      (assignment_operator)
      (integer_literal))
    (assignment_operation
      (identifier)
      (assignment_operator)
      (integer_literal))
    (assignment_operation
      (identifier)
      (assignment_operator)
      (integer_literal))))

================================================================================
Parenthesized expression sequence
================================================================================

var := (
    var2 := 2,
    var3 := "var3",
    var2
)

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (expression_sequence
      (assignment_operation
        (identifier)
        (assignment_operator)
        (integer_literal))
      (assignment_operation
        (identifier)
        (assignment_operator)
        (string_literal))
      (identifier))))

================================================================================
Multiline expression sequence
================================================================================

var := (
    var2 := 2,
    var3 := "var3",
    var2
)

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (expression_sequence
      (assignment_operation
        (identifier)
        (assignment_operator)
        (integer_literal))
      (assignment_operation
        (identifier)
        (assignment_operator)
        (string_literal))
      (identifier))))

================================================================================
Variable reference simple
================================================================================

&myVar

--------------------------------------------------------------------------------

(source_file
  (varref_operation
    (identifier)))

================================================================================
Variable reference quoted
================================================================================

&(a * b)

--------------------------------------------------------------------------------

(source_file
  (varref_operation
    (expression_sequence
      (multiplicative_operation
        (identifier)
        (identifier)))))

================================================================================
Nested parenthesized expression
================================================================================

result := (a + (b * c))

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (expression_sequence
      (additive_operation
        (identifier)
        (expression_sequence
          (multiplicative_operation
            (identifier)
            (identifier)))))))

================================================================================
Assignment with empty array literal
================================================================================

arr := []

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (array_literal)))

================================================================================
Assignment with nonempty array literal
================================================================================

arr := [1, "two", (1 + 2)]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (array_literal
      (expression_sequence
        (integer_literal)
        (string_literal)
        (expression_sequence
          (additive_operation
            (integer_literal)
            (integer_literal)))))))

================================================================================
Assignment with object literal
================================================================================

obj := {}

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (object_literal)))

================================================================================
Assignment with nonempty literal
================================================================================

obj := { 
  Add: (self, left, right) => (left + right) 
}

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (object_literal
      (object_literal_member_sequence
        (object_literal_member
          (identifier)
          (fat_arrow_function
            (function_head
              (param_sequence
                (identifier)
                (identifier)
                (identifier)))
            (arrow)
            (expression_sequence
              (additive_operation
                (identifier)
                (identifier)))))))))

================================================================================
Dereference expression sequence
================================================================================

result := %(a := "part", b := "part", a . b)%

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (dereference_operation
      (expression_sequence
        (assignment_operation
          (identifier)
          (assignment_operator)
          (string_literal))
        (assignment_operation
          (identifier)
          (assignment_operator)
          (string_literal))
        (explicit_concat_operation
          (identifier)
          (identifier))))))

================================================================================
Dereference expression as operand
================================================================================

result := a + %ref%

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (additive_operation
      (identifier)
      (dereference_operation
        (identifier)))))

================================================================================
VarRef and dereference combination
================================================================================

result := &%"ref"%

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (varref_operation
      (dereference_operation
        (string_literal)))))
