================================================================================
Simple expression sequence
================================================================================

x := 1, y := 2

--------------------------------------------------------------------------------

(source_file
  (expression_sequence
    (single_expression
      (assignment_operation
        (single_expression
          (identifier))
        (assignment_operator)
        (single_expression
          (literal
            (numeric_literal)))))
    (single_expression
      (assignment_operation
        (single_expression
          (identifier))
        (assignment_operator)
        (single_expression
          (literal
            (numeric_literal)))))))

================================================================================
Expression sequence with three items
================================================================================

a := 1, b := 2, c := 3

--------------------------------------------------------------------------------

(source_file
  (expression_sequence
    (single_expression
      (assignment_operation
        (single_expression
          (identifier))
        (assignment_operator)
        (single_expression
          (literal
            (numeric_literal)))))
    (single_expression
      (assignment_operation
        (single_expression
          (identifier))
        (assignment_operator)
        (single_expression
          (literal
            (numeric_literal)))))
    (single_expression
      (assignment_operation
        (single_expression
          (identifier))
        (assignment_operator)
        (single_expression
          (literal
            (numeric_literal)))))))

================================================================================
Parenthesized expression sequence
================================================================================

var := (
    var2 := 2,
    var3 := "var3",
    var2
)

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (expression_sequence
          (single_expression
            (assignment_operation
              (single_expression
                (identifier))
              (assignment_operator)
              (single_expression
                (literal
                  (numeric_literal)))))
          (single_expression
            (assignment_operation
              (single_expression
                (identifier))
              (assignment_operator)
              (single_expression
                (literal
                  (string_literal)))))
          (single_expression
            (identifier)))))))

================================================================================
Multiline expression sequence
================================================================================

var := (
    var2 := 2,
    var3 := "var3",
    var2
)

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (expression_sequence
          (single_expression
            (assignment_operation
              (single_expression
                (identifier))
              (assignment_operator)
              (single_expression
                (literal
                  (numeric_literal)))))
          (single_expression
            (assignment_operation
              (single_expression
                (identifier))
              (assignment_operator)
              (single_expression
                (literal
                  (string_literal)))))
          (single_expression
            (identifier)))))))

================================================================================
Variable reference simple
================================================================================

&myVar

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (prefix_operation
      (identifier))))

================================================================================
Variable reference quoted
================================================================================

&(a * b)

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (prefix_operation
      (expression_sequence
        (single_expression
          (multiplicative_operation
            (single_expression
              (identifier))
            (single_expression
              (identifier))))))))

================================================================================
Nested parenthesized expression
================================================================================

result := (a + (b * c))

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (expression_sequence
          (single_expression
            (additive_operation
              (single_expression
                (identifier))
              (single_expression
                (expression_sequence
                  (single_expression
                    (multiplicative_operation
                      (single_expression
                        (identifier))
                      (single_expression
                        (identifier)))))))))))))

================================================================================
Assignment with empty array literal
================================================================================

arr := []

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (literal
          (array_literal))))))

================================================================================
Assignment with nonempty array literal
================================================================================

arr := [1, "two", (1 + 2)]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (literal
          (array_literal
            (expression_sequence
              (single_expression
                (literal
                  (numeric_literal)))
              (single_expression
                (literal
                  (string_literal)))
              (single_expression
                (expression_sequence
                  (single_expression
                    (additive_operation
                      (single_expression
                        (literal
                          (numeric_literal)))
                      (single_expression
                        (literal
                          (numeric_literal))))))))))))))
