================================================================================
Fat-arrow function with no arguments
================================================================================

() => 1

--------------------------------------------------------------------------------

(source_file
  (fat_arrow_function
    (function_head)
    (arrow)
    (integer_literal)))

================================================================================
Fat-arrow function with wildcard
================================================================================

(*) => 1

--------------------------------------------------------------------------------

(source_file
  (fat_arrow_function
    (function_head
      (wildcard))
    (arrow)
    (integer_literal)))

================================================================================
Fat-arrow function with named argument
================================================================================

(arg1) => 1

--------------------------------------------------------------------------------

(source_file
  (fat_arrow_function
    (function_head
      (param_sequence
        (identifier)))
    (arrow)
    (integer_literal)))

================================================================================
Fat-arrow function with named ByRef argument
================================================================================

(&arg1) => 1

--------------------------------------------------------------------------------

(source_file
  (fat_arrow_function
    (function_head
      (param_sequence
        (byref_param
          (identifier))))
    (arrow)
    (integer_literal)))

================================================================================
Fat-arrow function with named argument with default
================================================================================

(arg1 := 42) => arg

--------------------------------------------------------------------------------

(source_file
  (fat_arrow_function
    (function_head
      (param_sequence
        (default_param
          (identifier)
          (assignment_operator)
          (float_literal))))
    (arrow)
    (identifier)))

================================================================================
Fat-arrow function with mixed argument types
================================================================================

(arg1 := 42, arg2, arg3?, &arg4 := 0, &arg5?, rest*) => 
    "this is a somewhat unrealistic example"

--------------------------------------------------------------------------------

(source_file
  (fat_arrow_function
    (function_head
      (param_sequence
        (default_param
          (identifier)
          (assignment_operator)
          (float_literal))
        (identifier)
        (optional_param
          (identifier)
          (optional_marker))
        (byref_param
          (default_param
            (identifier)
            (assignment_operator)
            (integer_literal)))
        (byref_param
          (optional_param
            (identifier)
            (optional_marker)))
        (variadic_param
          (identifier)
          (wildcard))))
    (arrow)
    (string_literal)))

================================================================================
Fat-arrow function with ByRef arg with default
================================================================================

(&arg1 := 0) => arg

--------------------------------------------------------------------------------

(source_file
  (fat_arrow_function
    (function_head
      (param_sequence
        (byref_param
          (default_param
            (identifier)
            (assignment_operator)
            (integer_literal)))))
    (arrow)
    (identifier)))

================================================================================
Fat-arrow function with optional argument
================================================================================

(arg?) => false

--------------------------------------------------------------------------------

(source_file
  (fat_arrow_function
    (function_head
      (param_sequence
        (optional_param
          (identifier)
          (optional_marker))))
    (arrow)
    (boolean_literal)))

================================================================================
Fat-arrow function with optional ByRef argument
================================================================================

(&arg?) => false

--------------------------------------------------------------------------------

(source_file
  (fat_arrow_function
    (function_head
      (param_sequence
        (byref_param
          (optional_param
            (identifier)
            (optional_marker)))))
    (arrow)
    (boolean_literal)))

================================================================================
Fat-arrow function with multiple named arguments
================================================================================

(arg1, arg2, arg3) => arg1 + arg2 + arg3

--------------------------------------------------------------------------------

(source_file
  (fat_arrow_function
    (function_head
      (param_sequence
        (identifier)
        (identifier)
        (identifier)))
    (arrow)
    (additive_operation
      (additive_operation
        (identifier)
        (identifier))
      (identifier))))

================================================================================
Fat-arrow function with with default from expression
================================================================================

(arg1 := 2 + 2) => arg1

--------------------------------------------------------------------------------

(source_file
  (fat_arrow_function
    (function_head
      (param_sequence
        (default_param
          (identifier)
          (assignment_operator)
          (additive_operation
            (integer_literal)
            (integer_literal)))))
    (arrow)
    (identifier)))

================================================================================
Fat-arrow function body on new line
================================================================================

(arg1) 
    => "string literal"

--------------------------------------------------------------------------------

(source_file
  (fat_arrow_function
    (function_head
      (param_sequence
        (identifier)))
    (arrow)
    (string_literal)))

================================================================================
Fat-arrow function with named variadic argument
================================================================================

(params*) => "params"

--------------------------------------------------------------------------------

(source_file
  (fat_arrow_function
    (function_head
      (param_sequence
        (variadic_param
          (identifier)
          (wildcard))))
    (arrow)
    (string_literal)))

================================================================================
Fat-arrow function with multiple named arguments with variadic
================================================================================

(arg1, others*) => "test"

--------------------------------------------------------------------------------

(source_file
  (fat_arrow_function
    (function_head
      (param_sequence
        (identifier)
        (variadic_param
          (identifier)
          (wildcard))))
    (arrow)
    (string_literal)))

================================================================================
Fat-arrow function with parenthesized expression sequence
================================================================================

(arg1) => (a := 1, b := 2, a + b)

--------------------------------------------------------------------------------

(source_file
  (fat_arrow_function
    (function_head
      (param_sequence
        (identifier)))
    (arrow)
    (expression_sequence
      (assignment_operation
        (identifier)
        (assignment_operator)
        (integer_literal))
      (assignment_operation
        (identifier)
        (assignment_operator)
        (integer_literal))
      (additive_operation
        (identifier)
        (identifier)))))

================================================================================
Fat-arrow function with multiline parenthesized expression sequence
================================================================================

(arg1, arg2) => (
    a := arg1, 
    b := arg2, 
    a + b
)

--------------------------------------------------------------------------------

(source_file
  (fat_arrow_function
    (function_head
      (param_sequence
        (identifier)
        (identifier)))
    (arrow)
    (expression_sequence
      (assignment_operation
        (identifier)
        (assignment_operator)
        (identifier))
      (assignment_operation
        (identifier)
        (assignment_operator)
        (identifier))
      (additive_operation
        (identifier)
        (identifier)))))

================================================================================
Fat-arrow function nested
================================================================================

(arg1, arg2) => ( 
    (arg1, arg2) => arg1 + arg2
)

--------------------------------------------------------------------------------

(source_file
  (fat_arrow_function
    (function_head
      (param_sequence
        (identifier)
        (identifier)))
    (arrow)
    (expression_sequence
      (fat_arrow_function
        (function_head
          (param_sequence
            (identifier)
            (identifier)))
        (arrow)
        (additive_operation
          (identifier)
          (identifier))))))
