================================================================================
Function declaration with block body
================================================================================

Function() {
    var := 1
}

--------------------------------------------------------------------------------

(source_file
  (function_declaration
    (identifier)
    (function_head)
    (function_body
      (block
        (assignment_operation
          (identifier)
          (assignment_operator)
          (integer_literal))))))

================================================================================
Function declaration with fat arrow budy
================================================================================

Function() => 1

--------------------------------------------------------------------------------

(source_file
  (function_declaration
    (identifier)
    (function_head)
    (function_body
      (integer_literal))))

================================================================================
Static function (Note: only legal in class definitions)
================================================================================

static Function(arg1, arg2) {
    var3 := arg1 + arg2
}

--------------------------------------------------------------------------------

(source_file
  (function_declaration
    (scope_identifier)
    (identifier)
    (function_head
      (param_sequence
        (identifier)
        (identifier)))
    (function_body
      (block
        (assignment_operation
          (identifier)
          (assignment_operator)
          (additive_operation
            (identifier)
            (identifier)))))))

================================================================================
Static function with fat arrow body
================================================================================

static Function(arg1, arg2) => arg1 - arg2

--------------------------------------------------------------------------------

(source_file
  (function_declaration
    (scope_identifier)
    (identifier)
    (function_head
      (param_sequence
        (identifier)
        (identifier)))
    (function_body
      (additive_operation
        (identifier)
        (identifier)))))

================================================================================
Function declaration wildcard parameter
================================================================================

Function(*) {
    var := "test"
}

--------------------------------------------------------------------------------

(source_file
  (function_declaration
    (identifier)
    (function_head
      (wildcard))
    (function_body
      (block
        (assignment_operation
          (identifier)
          (assignment_operator)
          (string_literal))))))

================================================================================
Function declaration named parameters
================================================================================

Function(arg1, arg2) {
    var := arg1 . arg2 . "test"
}

--------------------------------------------------------------------------------

(source_file
  (function_declaration
    (identifier)
    (function_head
      (param_sequence
        (identifier)
        (identifier)))
    (function_body
      (block
        (assignment_operation
          (identifier)
          (assignment_operator)
          (explicit_concat_operation
            (explicit_concat_operation
              (identifier)
              (identifier))
            (string_literal)))))))

================================================================================
Function declaration variadic parameters
================================================================================

Function(params*) {
    var := arg1 . arg2 . "test"
}

--------------------------------------------------------------------------------

(source_file
  (function_declaration
    (identifier)
    (function_head
      (param_sequence
        (variadic_param
          (identifier)
          (wildcard))))
    (function_body
      (block
        (assignment_operation
          (identifier)
          (assignment_operator)
          (explicit_concat_operation
            (explicit_concat_operation
              (identifier)
              (identifier))
            (string_literal)))))))

================================================================================
Nested functions
================================================================================

Function(params*) {
    Nested(*) {
        static var2 := "nested function!"
    }
}

--------------------------------------------------------------------------------

(source_file
  (function_declaration
    (identifier)
    (function_head
      (param_sequence
        (variadic_param
          (identifier)
          (wildcard))))
    (function_body
      (block
        (function_declaration
          (identifier)
          (function_head
            (wildcard))
          (function_body
            (block
              (assignment_operation
                (variable_declaration
                  (scope_identifier)
                  (identifier))
                (assignment_operator)
                (string_literal)))))))))

================================================================================
Multiple nested functions
================================================================================

Function(params*) {
    Nested(*) {
        static var2 := "nested function!"
    }

    NestedTwo(arg1, arg2) => arg1 + arg2
}

--------------------------------------------------------------------------------

(source_file
  (function_declaration
    (identifier)
    (function_head
      (param_sequence
        (variadic_param
          (identifier)
          (wildcard))))
    (function_body
      (block
        (function_declaration
          (identifier)
          (function_head
            (wildcard))
          (function_body
            (block
              (assignment_operation
                (variable_declaration
                  (scope_identifier)
                  (identifier))
                (assignment_operator)
                (string_literal)))))
        (function_declaration
          (identifier)
          (function_head
            (param_sequence
              (identifier)
              (identifier)))
          (function_body
            (additive_operation
              (identifier)
              (identifier))))))))

================================================================================
Static nested function
================================================================================

Function(arg1, arg2) {
    static Nested() {
        var := "arg3"
    }
}

--------------------------------------------------------------------------------

(source_file
  (function_declaration
    (identifier)
    (function_head
      (param_sequence
        (identifier)
        (identifier)))
    (function_body
      (block
        (function_declaration
          (scope_identifier)
          (identifier)
          (function_head)
          (function_body
            (block
              (assignment_operation
                (identifier)
                (assignment_operator)
                (string_literal)))))))))

================================================================================
Deeply nested functions
================================================================================

Function(params*) {
    LevelOne(*) {
        LevelTwo() {
            LevelThree() {
                LevelFour(val := "test") {
                    LevelFive() => "an arrow function!"
                }
            }
        }
    }
}

--------------------------------------------------------------------------------

(source_file
  (function_declaration
    (identifier)
    (function_head
      (param_sequence
        (variadic_param
          (identifier)
          (wildcard))))
    (function_body
      (block
        (function_declaration
          (identifier)
          (function_head
            (wildcard))
          (function_body
            (block
              (function_declaration
                (identifier)
                (function_head)
                (function_body
                  (block
                    (function_declaration
                      (identifier)
                      (function_head)
                      (function_body
                        (block
                          (function_declaration
                            (identifier)
                            (function_head
                              (param_sequence
                                (default_param
                                  (identifier)
                                  (assignment_operator)
                                  (string_literal))))
                            (function_body
                              (block
                                (function_declaration
                                  (identifier)
                                  (function_head)
                                  (function_body
                                    (string_literal)))))))))))))))))))

================================================================================
Brace on new line
================================================================================

Function(arg1, arg2, &out) 
{
    &out := arg1 + arg2
}

--------------------------------------------------------------------------------

(source_file
  (function_declaration
    (identifier)
    (function_head
      (param_sequence
        (identifier)
        (identifier)
        (byref_param
          (identifier))))
    (function_body
      (block
        (assignment_operation
          (varref_operation
            (identifier))
          (assignment_operator)
          (additive_operation
            (identifier)
            (identifier)))))))

================================================================================
Function with empty body
================================================================================

Function(arg1, arg2) {

}

--------------------------------------------------------------------------------

(source_file
  (function_declaration
    (identifier)
    (function_head
      (param_sequence
        (identifier)
        (identifier)))
    (function_body
      (block))))

================================================================================
Function with return statement
================================================================================

Function(arg1, arg2) {
    return(arg1 + arg2)
}

--------------------------------------------------------------------------------

(source_file
  (function_declaration
    (identifier)
    (function_head
      (param_sequence
        (identifier)
        (identifier)))
    (function_body
      (block
        (return_statement
          (return)
          (expression_sequence
            (additive_operation
              (identifier)
              (identifier))))))))

================================================================================
Function with optional argument
================================================================================

Function(arg1?) {
    return 1
}

--------------------------------------------------------------------------------

(source_file
  (function_declaration
    (identifier)
    (function_head
      (param_sequence
        (optional_param
          (identifier)
          (optional_marker))))
    (function_body
      (block
        (return_statement
          (return)
          (integer_literal))))))

================================================================================
Function with wildcard after parameter liest
================================================================================

Function(arg1, *) {
    return 1
}

--------------------------------------------------------------------------------

(source_file
  (function_declaration
    (identifier)
    (function_head
      (param_sequence
        (identifier)
        (wildcard)))
    (function_body
      (block
        (return_statement
          (return)
          (integer_literal))))))

================================================================================
Function with variadic arg after parameter liest
================================================================================

Function(arg1, params*) {
    return 1
}

--------------------------------------------------------------------------------

(source_file
  (function_declaration
    (identifier)
    (function_head
      (param_sequence
        (identifier)
        (variadic_param
          (identifier)
          (wildcard))))
    (function_body
      (block
        (return_statement
          (return)
          (integer_literal))))))

================================================================================
Function with wildcard not at end
:error
================================================================================

Function(arg1, *, illegal) {
    return 1
}

--------------------------------------------------------------------------------



================================================================================
Function with variadic arg not at end
:error
================================================================================

Function(arg1, variadic*, illegal) {
    return 1
}

--------------------------------------------------------------------------------


