================================================================================
Simple call
================================================================================

MsgBox("Hello, World!")

--------------------------------------------------------------------------------

(source_file
  (function_call
    (identifier)
    (arg_sequence
      (string_literal))))

================================================================================
Simple call statement
================================================================================

MsgBox "Hello, World!"

--------------------------------------------------------------------------------

(source_file
  (call_statement
    (identifier)
    (arg_sequence
      (string_literal))))

================================================================================
Function call with multiple arguments
================================================================================

MsgBox("Hello, World!", A_ScriptName, "Iconi OK")

--------------------------------------------------------------------------------

(source_file
  (function_call
    (identifier)
    (arg_sequence
      (string_literal)
      (identifier)
      (string_literal))))

================================================================================
Function call empty argument
================================================================================

Function(, "Second argument")
--------------------------------------------------------------------------------

(source_file
  (function_call
    (identifier)
    (arg_sequence
      (empty_arg)
      (string_literal))))

================================================================================
Call statement with empty argument
================================================================================

Function , "Second argument"

--------------------------------------------------------------------------------

(source_file
  (call_statement
    (identifier)
    (arg_sequence
      (empty_arg)
      (string_literal))))

================================================================================
Function call with trailing comma
================================================================================

Function(,)

--------------------------------------------------------------------------------

(source_file
  (function_call
    (identifier)
    (arg_sequence
      (empty_arg))))

================================================================================
Call statement with trailing comma
================================================================================

Function , 

--------------------------------------------------------------------------------

(source_file
  (call_statement
    (identifier)
    (arg_sequence
      (empty_arg))))

================================================================================
Call statement with multiple arguments
================================================================================

MsgBox "Hello, World!", A_ScriptName, "Iconi OK"

--------------------------------------------------------------------------------

(source_file
  (call_statement
    (identifier)
    (arg_sequence
      (string_literal)
      (identifier)
      (string_literal))))

================================================================================
Function call with arguments accross multiple lines
================================================================================

MsgBox(
    "Hello, World!", 
    A_ScriptName, 
    "Iconi OK"
)

--------------------------------------------------------------------------------

(source_file
  (function_call
    (identifier)
    (arg_sequence
      (string_literal)
      (identifier)
      (string_literal))))

================================================================================
Chained function calls
================================================================================

First().Second().Third()

--------------------------------------------------------------------------------

(source_file
  (function_call
    (member_access
      (function_call
        (member_access
          (function_call
            (identifier))
          (member_identifier
            (identifier))))
      (member_identifier
        (identifier)))))

================================================================================
Chained function calls multiline
================================================================================

First().Second().Third()

--------------------------------------------------------------------------------

(source_file
  (function_call
    (member_access
      (function_call
        (member_access
          (function_call
            (identifier))
          (member_identifier
            (identifier))))
      (member_identifier
        (identifier)))))

================================================================================
Method call
================================================================================

obj.Method(1, 2)

--------------------------------------------------------------------------------

(source_file
  (function_call
    (member_access
      (identifier)
      (member_identifier
        (identifier)))
    (arg_sequence
      (integer_literal)
      (integer_literal))))

================================================================================
Method call statement
================================================================================

obj.Method 1, 2

--------------------------------------------------------------------------------

(source_file
  (call_statement
    (member_access
      (identifier)
      (member_identifier
        (identifier)))
    (arg_sequence
      (integer_literal)
      (integer_literal))))

================================================================================
Call with dynamic identifier
================================================================================

%object%(1, 2)

--------------------------------------------------------------------------------

(source_file
  (function_call
    (dereference_operation
      (identifier))
    (arg_sequence
      (integer_literal)
      (integer_literal))))

================================================================================
Call statement with no arguments
================================================================================

Critical

--------------------------------------------------------------------------------

(source_file
  (call_statement
    (identifier)))
