================================================================================
Simple index access
================================================================================

val := arr[1]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (index_access
      (identifier)
      (arg_sequence
        (integer_literal)))))

================================================================================
Index access without arguments
================================================================================

val := arr[]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (index_access
      (identifier))))

================================================================================
Index access with two arguments
================================================================================

val := arr[arg1, arg2]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (index_access
      (identifier)
      (arg_sequence
        (identifier)
        (identifier)))))

================================================================================
Index access with two arguments
================================================================================

val := arr[arg1, arg2]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (index_access
      (identifier)
      (arg_sequence
        (identifier)
        (identifier)))))

================================================================================
Index access with array expansion
================================================================================

val := arr[arg1*]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (index_access
      (identifier)
      (arg_sequence
        (identifier)
        (array_expansion_marker)))))

================================================================================
Index access with multiple arguments and array expansion
================================================================================

val := arr[arg1, arg2*]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (index_access
      (identifier)
      (arg_sequence
        (identifier)
        (identifier)
        (array_expansion_marker)))))

================================================================================
Index access with arg with assignment
================================================================================

val := arr[arg1 := a + 2]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (index_access
      (identifier)
      (arg_sequence
        (assignment_operation
          (identifier)
          (assignment_operator)
          (additive_operation
            (identifier)
            (integer_literal)))))))

================================================================================
Index access split over multiple lines
================================================================================

val := arr[
    arg1 := a + 2,
    condition ? true : false
]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (index_access
      (identifier)
      (arg_sequence
        (assignment_operation
          (identifier)
          (assignment_operator)
          (additive_operation
            (identifier)
            (integer_literal)))
        (ternary_expression
          (identifier)
          (boolean_literal)
          (boolean_literal))))))

================================================================================
Index access to object member
================================================================================

val := obj.property[1]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (index_access
      (member_access
        (identifier)
        (member_identifier
          (identifier)))
      (arg_sequence
        (integer_literal)))))

================================================================================
Index access to dynamic reference
================================================================================

val := %array%[1]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (index_access
      (dereference_operation
        (identifier))
      (arg_sequence
        (integer_literal)))))

================================================================================
Index access to dynamic object member
================================================================================

val := obj.%array%[1]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (index_access
      (member_access
        (identifier)
        (member_identifier
          (dynamic_identifier
            (dereference_operation
              (identifier)))))
      (arg_sequence
        (integer_literal)))))

================================================================================
Chained index access
================================================================================

val := arr[1][1]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (index_access
      (index_access
        (identifier)
        (arg_sequence
          (integer_literal)))
      (arg_sequence
        (integer_literal)))))

================================================================================
Index access with array literal
================================================================================

val := ["first", "second", "third"][2]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (index_access
      (array_literal
        (expression_sequence
          (string_literal)
          (string_literal)
          (string_literal)))
      (arg_sequence
        (integer_literal)))))

================================================================================
Index access with array literal as argument
================================================================================

val := obj[[1, 2, 3]]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (index_access
      (identifier)
      (arg_sequence
        (array_literal
          (expression_sequence
            (integer_literal)
            (integer_literal)
            (integer_literal)))))))

================================================================================
Index access with array literal and other expression as argument
================================================================================

val := obj["str", [1, 2, 3]]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (index_access
      (identifier)
      (arg_sequence
        (string_literal)
        (array_literal
          (expression_sequence
            (integer_literal)
            (integer_literal)
            (integer_literal)))))))

================================================================================
Index followed by member access
================================================================================

val := arr[1].property

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (member_access
      (index_access
        (identifier)
        (arg_sequence
          (integer_literal)))
      (member_identifier
        (identifier)))))

================================================================================
Index access with optional argument
================================================================================

val := arr[a?]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (index_access
      (identifier)
      (arg_sequence
        (optional_arg
          (identifier)
          (optional_marker))))))

================================================================================
Index access with mixed required and optional arguments
================================================================================

val := arr[a, b?]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (index_access
      (identifier)
      (arg_sequence
        (identifier)
        (optional_arg
          (identifier)
          (optional_marker))))))

================================================================================
Index access with arugment with default value
================================================================================

val := arr[index := 1]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (index_access
      (identifier)
      (arg_sequence
        (assignment_operation
          (identifier)
          (assignment_operator)
          (integer_literal))))))

================================================================================
Index in arithmetic
================================================================================

val := arr[1] + arr[2]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (additive_operation
      (index_access
        (identifier)
        (arg_sequence
          (integer_literal)))
      (index_access
        (identifier)
        (arg_sequence
          (integer_literal))))))

================================================================================
Index access with empty argument
================================================================================

val := arr[, arg2]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (index_access
      (identifier)
      (arg_sequence
        (empty_arg)
        (identifier)))))

================================================================================
Index access with empty arg and trailing comma
================================================================================

val := arr[,]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (index_access
      (identifier)
      (arg_sequence
        (empty_arg)))))
