================================================================================
Simple index access
================================================================================

val := arr[1]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (index_access
          (single_expression
            (identifier))
          (arg_sequence
            (arg
              (expression_sequence
                (single_expression
                  (literal
                    (integer_literal)))))))))))

================================================================================
Index access without arguments
================================================================================

val := arr[]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (index_access
          (single_expression
            (identifier)))))))

================================================================================
Index access with two arguments
================================================================================

val := arr[arg1, arg2]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (index_access
          (single_expression
            (identifier))
          (arg_sequence
            (arg
              (expression_sequence
                (single_expression
                  (identifier))))
            (arg
              (expression_sequence
                (single_expression
                  (identifier))))))))))

================================================================================
Index access with two arguments
================================================================================

val := arr[arg1, arg2]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (index_access
          (single_expression
            (identifier))
          (arg_sequence
            (arg
              (expression_sequence
                (single_expression
                  (identifier))))
            (arg
              (expression_sequence
                (single_expression
                  (identifier))))))))))

================================================================================
Index access with array expansion
================================================================================

val := arr[arg1*]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (index_access
          (single_expression
            (identifier))
          (arg_sequence
            (single_expression
              (identifier))
            (array_expansion_marker)))))))

================================================================================
Index access with multiple arguments and array expansion
================================================================================

val := arr[arg1, arg2*]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (index_access
          (single_expression
            (identifier))
          (arg_sequence
            (arg
              (expression_sequence
                (single_expression
                  (identifier))))
            (single_expression
              (identifier))
            (array_expansion_marker)))))))

================================================================================
Index access with arg with assignment
================================================================================

val := arr[arg1 := a + 2]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (index_access
          (single_expression
            (identifier))
          (arg_sequence
            (arg
              (expression_sequence
                (single_expression
                  (assignment_operation
                    (single_expression
                      (identifier))
                    (assignment_operator)
                    (single_expression
                      (additive_operation
                        (single_expression
                          (identifier))
                        (single_expression
                          (literal
                            (integer_literal)))))))))))))))

================================================================================
Index access split over multiple lines
================================================================================

val := arr[
    arg1 := a + 2,
    condition ? true : false
]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (index_access
          (single_expression
            (identifier))
          (arg_sequence
            (arg
              (expression_sequence
                (single_expression
                  (assignment_operation
                    (single_expression
                      (identifier))
                    (assignment_operator)
                    (single_expression
                      (additive_operation
                        (single_expression
                          (identifier))
                        (single_expression
                          (literal
                            (integer_literal)))))))))
            (arg
              (expression_sequence
                (single_expression
                  (ternary_expression
                    (single_expression
                      (identifier))
                    (single_expression
                      (literal
                        (boolean_literal)))
                    (single_expression
                      (literal
                        (boolean_literal)))))))))))))

================================================================================
Index access to object member
================================================================================

val := obj.property[1]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (index_access
          (single_expression
            (member_access
              (single_expression
                (identifier))
              (member_identifier
                (identifier))))
          (arg_sequence
            (arg
              (expression_sequence
                (single_expression
                  (literal
                    (integer_literal)))))))))))

================================================================================
Index access to dynamic reference
================================================================================

val := %array%[1]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (index_access
          (single_expression
            (dereference_operation
              (single_expression
                (identifier))))
          (arg_sequence
            (arg
              (expression_sequence
                (single_expression
                  (literal
                    (integer_literal)))))))))))

================================================================================
Index access to dynamic object member
================================================================================

val := obj.%array%[1]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (index_access
          (single_expression
            (member_access
              (single_expression
                (identifier))
              (member_identifier
                (dynamic_identifier
                  (dereference_operation
                    (single_expression
                      (identifier)))))))
          (arg_sequence
            (arg
              (expression_sequence
                (single_expression
                  (literal
                    (integer_literal)))))))))))

================================================================================
Chained index access
================================================================================

val := arr[1][1]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (index_access
          (single_expression
            (index_access
              (single_expression
                (identifier))
              (arg_sequence
                (arg
                  (expression_sequence
                    (single_expression
                      (literal
                        (integer_literal))))))))
          (arg_sequence
            (arg
              (expression_sequence
                (single_expression
                  (literal
                    (integer_literal)))))))))))

================================================================================
Index access with array literal
================================================================================

val := ["first", "second", "third"][2]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (index_access
          (single_expression
            (literal
              (array_literal
                (expression_sequence
                  (single_expression
                    (literal
                      (string_literal)))
                  (single_expression
                    (literal
                      (string_literal)))
                  (single_expression
                    (literal
                      (string_literal)))))))
          (arg_sequence
            (arg
              (expression_sequence
                (single_expression
                  (literal
                    (integer_literal)))))))))))

================================================================================
Index access with array literal as argument
================================================================================

val := obj[[1, 2, 3]]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (index_access
          (single_expression
            (identifier))
          (arg_sequence
            (arg
              (expression_sequence
                (single_expression
                  (literal
                    (array_literal
                      (expression_sequence
                        (single_expression
                          (literal
                            (integer_literal)))
                        (single_expression
                          (literal
                            (integer_literal)))
                        (single_expression
                          (literal
                            (integer_literal)))))))))))))))

================================================================================
Index access with array literal and other expression as argument
================================================================================

val := obj["str", [1, 2, 3]]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (index_access
          (single_expression
            (identifier))
          (arg_sequence
            (arg
              (expression_sequence
                (single_expression
                  (literal
                    (string_literal)))))
            (arg
              (expression_sequence
                (single_expression
                  (literal
                    (array_literal
                      (expression_sequence
                        (single_expression
                          (literal
                            (integer_literal)))
                        (single_expression
                          (literal
                            (integer_literal)))
                        (single_expression
                          (literal
                            (integer_literal)))))))))))))))

================================================================================
Index followed by member access
================================================================================

val := arr[1].property

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (member_access
          (single_expression
            (index_access
              (single_expression
                (identifier))
              (arg_sequence
                (arg
                  (expression_sequence
                    (single_expression
                      (literal
                        (integer_literal))))))))
          (member_identifier
            (identifier)))))))

================================================================================
Index access with optional argument
================================================================================

val := arr[a?]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (index_access
          (single_expression
            (identifier))
          (arg_sequence
            (arg
              (optional_identifier
                (identifier)
                (optional_marker)))))))))

================================================================================
Index access with mixed required and optional arguments
================================================================================

val := arr[a, b?]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (index_access
          (single_expression
            (identifier))
          (arg_sequence
            (arg
              (expression_sequence
                (single_expression
                  (identifier))))
            (arg
              (optional_identifier
                (identifier)
                (optional_marker)))))))))

================================================================================
Index access with arugment with default value
================================================================================

val := arr[index := 1]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (index_access
          (single_expression
            (identifier))
          (arg_sequence
            (arg
              (expression_sequence
                (single_expression
                  (assignment_operation
                    (single_expression
                      (identifier))
                    (assignment_operator)
                    (single_expression
                      (literal
                        (integer_literal)))))))))))))

================================================================================
Index in arithmetic
================================================================================

val := arr[1] + arr[2]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (additive_operation
          (single_expression
            (index_access
              (single_expression
                (identifier))
              (arg_sequence
                (arg
                  (expression_sequence
                    (single_expression
                      (literal
                        (integer_literal))))))))
          (single_expression
            (index_access
              (single_expression
                (identifier))
              (arg_sequence
                (arg
                  (expression_sequence
                    (single_expression
                      (literal
                        (integer_literal)))))))))))))

================================================================================
Index access with empty argument
================================================================================

val := arr[, arg2]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (index_access
          (single_expression
            (identifier))
          (arg_sequence
            (arg
              (empty_arg))
            (arg
              (expression_sequence
                (single_expression
                  (identifier))))))))))

================================================================================
Index access with empty arg and trailing comma
================================================================================

val := arr[,]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (index_access
          (single_expression
            (identifier))
          (arg_sequence
            (arg
              (empty_arg))))))))
