================================================================================
Integer literal
================================================================================

42

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (numeric_literal))))

================================================================================
Negative integer
================================================================================

-42

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (numeric_literal))))

================================================================================
Float literal
================================================================================

3.14

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (numeric_literal))))

================================================================================
Hex literal
================================================================================

0xFF00

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (numeric_literal))))

================================================================================
Double-quoted string
================================================================================

"hello world"

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (string_literal))))

================================================================================
Single-quoted string
================================================================================

'hello world'

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (string_literal))))

================================================================================
String with single quotes inside double quotes
================================================================================

"un 'quote' d"

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (string_literal))))

================================================================================
String with double quotes inside single quotes
================================================================================

'outer "double quoted" outer'

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (string_literal))))

================================================================================
String with nested single quotes
================================================================================

"she said 'hello' to me"

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (string_literal))))

================================================================================
String with escape sequence
================================================================================

"line1`nline2"

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (string_literal))))

================================================================================
String with unused escape sequence
================================================================================

"line1` line2"

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (string_literal))))

================================================================================
String with escaped backtick
================================================================================

"line1``line2"

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (string_literal))))

================================================================================
Empty double-quoted string
================================================================================

""

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (string_literal))))

================================================================================
Empty single-quoted string
================================================================================

''

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (string_literal))))

================================================================================
Boolean true lowercase
================================================================================

true

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (boolean_literal))))

================================================================================
Boolean true uppercase
================================================================================

TRUE

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (boolean_literal))))

================================================================================
Boolean false mixed case
================================================================================

False

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (boolean_literal))))

================================================================================
Unset literal
================================================================================

unset

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (unset))))
