================================================================================
Integer literal
================================================================================

42

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (numeric_literal))))

================================================================================
Negative integer
================================================================================

-42

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (numeric_literal))))

================================================================================
Float literal
================================================================================

3.14

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (numeric_literal))))

================================================================================
Hex literal
================================================================================

0xFF00

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (numeric_literal))))

================================================================================
Double-quoted string
================================================================================

"hello world"

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (string_literal))))

================================================================================
Single-quoted string
================================================================================

'hello world'

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (string_literal))))

================================================================================
String with single quotes inside double quotes
================================================================================

"un 'quote' d"

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (string_literal))))

================================================================================
String with double quotes inside single quotes
================================================================================

'outer "double quoted" outer'

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (string_literal))))

================================================================================
String with nested single quotes
================================================================================

"she said 'hello' to me"

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (string_literal))))

================================================================================
String with escape sequence
================================================================================

"line1`nline2"

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (string_literal))))

================================================================================
String with unused escape sequence
================================================================================

"line1` line2"

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (string_literal))))

================================================================================
String with escaped backtick
================================================================================

"line1``line2"

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (string_literal))))

================================================================================
Empty double-quoted string
================================================================================

""

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (string_literal))))

================================================================================
Empty single-quoted string
================================================================================

''

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (string_literal))))

================================================================================
Boolean true lowercase
================================================================================

true

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (boolean_literal))))

================================================================================
Boolean true uppercase
================================================================================

TRUE

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (boolean_literal))))

================================================================================
Boolean false mixed case
================================================================================

False

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (boolean_literal))))

================================================================================
Unset literal
================================================================================

unset

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (unset))))

================================================================================
Empty array literal
================================================================================

[]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (array_literal))))

================================================================================
Array literal with string literals
================================================================================

["one", "two", "three"]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (array_literal
        (expression_sequence
          (single_expression
            (literal
              (string_literal)))
          (single_expression
            (literal
              (string_literal)))
          (single_expression
            (literal
              (string_literal))))))))

================================================================================
Array literal with expressions
================================================================================

[
    one := 1,
    two := 2,
    (a := 3 + 3, a + 3)
]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (array_literal
        (expression_sequence
          (single_expression
            (assignment_operation
              (single_expression
                (identifier))
              (assignment_operator)
              (single_expression
                (literal
                  (numeric_literal)))))
          (single_expression
            (assignment_operation
              (single_expression
                (identifier))
              (assignment_operator)
              (single_expression
                (literal
                  (numeric_literal)))))
          (single_expression
            (expression_sequence
              (single_expression
                (assignment_operation
                  (single_expression
                    (identifier))
                  (assignment_operator)
                  (single_expression
                    (additive_operation
                      (single_expression
                        (literal
                          (numeric_literal)))
                      (single_expression
                        (literal
                          (numeric_literal)))))))
              (single_expression
                (additive_operation
                  (single_expression
                    (identifier))
                  (single_expression
                    (literal
                      (numeric_literal))))))))))))

================================================================================
Array literal with numbers
================================================================================

[1, 2, 3]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (array_literal
        (expression_sequence
          (single_expression
            (literal
              (numeric_literal)))
          (single_expression
            (literal
              (numeric_literal)))
          (single_expression
            (literal
              (numeric_literal))))))))

================================================================================
Array literal with object literals
================================================================================

[
  { one: "one" },
  { two: "two"}
]

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (array_literal
        (expression_sequence
          (single_expression
            (literal
              (object_literal
                (object_literal_member_sequence
                  (object_literal_member
                    (identifier)
                    (single_expression
                      (literal
                        (string_literal))))))))
          (single_expression
            (literal
              (object_literal
                (object_literal_member_sequence
                  (object_literal_member
                    (identifier)
                    (single_expression
                      (literal
                        (string_literal)))))))))))))

================================================================================
Empty object literal
================================================================================

{}

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (object_literal))))

================================================================================
Object literal with simple member
================================================================================

{ one: 1 }

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (object_literal
        (object_literal_member_sequence
          (object_literal_member
            (identifier)
            (single_expression
              (literal
                (numeric_literal)))))))))

================================================================================
Object literal with multiple members
================================================================================

{ 
  one: 1,
  two: "two"
}

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (object_literal
        (object_literal_member_sequence
          (object_literal_member
            (identifier)
            (single_expression
              (literal
                (numeric_literal))))
          (object_literal_member
            (identifier)
            (single_expression
              (literal
                (string_literal)))))))))

================================================================================
Object literal with expression member
================================================================================

{ 
  one: 1,
  two: "2",
  three: (a := 1, b := 2, a + b)
}

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (object_literal
        (object_literal_member_sequence
          (object_literal_member
            (identifier)
            (single_expression
              (literal
                (numeric_literal))))
          (object_literal_member
            (identifier)
            (single_expression
              (literal
                (string_literal))))
          (object_literal_member
            (identifier)
            (single_expression
              (expression_sequence
                (single_expression
                  (assignment_operation
                    (single_expression
                      (identifier))
                    (assignment_operator)
                    (single_expression
                      (literal
                        (numeric_literal)))))
                (single_expression
                  (assignment_operation
                    (single_expression
                      (identifier))
                    (assignment_operator)
                    (single_expression
                      (literal
                        (numeric_literal)))))
                (single_expression
                  (additive_operation
                    (single_expression
                      (identifier))
                    (single_expression
                      (identifier))))))))))))

================================================================================
Object literal with array
================================================================================

{ emptyArr: [] }

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (object_literal
        (object_literal_member_sequence
          (object_literal_member
            (identifier)
            (single_expression
              (literal
                (array_literal)))))))))

================================================================================
Object literal with fat-arrow function member
================================================================================

{ Add: (self, left, right) => left + right }

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (object_literal
        (object_literal_member_sequence
          (object_literal_member
            (identifier)
            (single_expression
              (fat_arrow_function
                (function_head
                  (param_sequence
                    (param
                      (identifier))
                    (param
                      (identifier))
                    (param
                      (identifier))))
                (arrow)
                (additive_operation
                  (single_expression
                    (identifier))
                  (single_expression
                    (identifier)))))))))))

================================================================================
Object literal multiline with fat-arrow function members
================================================================================

{ 
  Add: (self, left, right) => left + right,
  Subtract: (self, left, right) => left - right
}

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (object_literal
        (object_literal_member_sequence
          (object_literal_member
            (identifier)
            (single_expression
              (fat_arrow_function
                (function_head
                  (param_sequence
                    (param
                      (identifier))
                    (param
                      (identifier))
                    (param
                      (identifier))))
                (arrow)
                (additive_operation
                  (single_expression
                    (identifier))
                  (single_expression
                    (identifier))))))
          (object_literal_member
            (identifier)
            (single_expression
              (fat_arrow_function
                (function_head
                  (param_sequence
                    (param
                      (identifier))
                    (param
                      (identifier))
                    (param
                      (identifier))))
                (arrow)
                (additive_operation
                  (single_expression
                    (identifier))
                  (single_expression
                    (identifier)))))))))))

================================================================================
Nested object literals
================================================================================

{ 
  __Class: "Object",
  
  nested: { 
    __Class: "Nested",
    meaningOfLife: 42
  } 
}

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (literal
      (object_literal
        (object_literal_member_sequence
          (object_literal_member
            (identifier)
            (single_expression
              (literal
                (string_literal))))
          (object_literal_member
            (identifier)
            (single_expression
              (literal
                (object_literal
                  (object_literal_member_sequence
                    (object_literal_member
                      (identifier)
                      (single_expression
                        (literal
                          (string_literal))))
                    (object_literal_member
                      (identifier)
                      (single_expression
                        (literal
                          (numeric_literal))))))))))))))
