================================================================================
Integer literal
================================================================================

var := 42

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (integer_literal)))

================================================================================
Negative integer
================================================================================

var := -42

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (prefix_operation
      (integer_literal))))

================================================================================
Float literal
================================================================================

var := 3.14

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (float_literal)))

================================================================================
Hex literal
================================================================================

var := 0xFF00

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (hex_literal)))

================================================================================
Double-quoted string
================================================================================

var := "hello world"

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (string_literal)))

================================================================================
Single-quoted string
================================================================================

var := 'hello world'

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (string_literal)))

================================================================================
String with single quotes inside double quotes
================================================================================

var := "un 'quote' d"

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (string_literal)))

================================================================================
String with double quotes inside single quotes
================================================================================

var := 'outer "double quoted" outer'

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (string_literal)))

================================================================================
String with nested single quotes
================================================================================

var := "she said 'hello' to me"

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (string_literal)))

================================================================================
String with escape sequence
================================================================================

var := "line1`nline2"

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (string_literal)))

================================================================================
String with unused escape sequence
================================================================================

var := "line1` line2"

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (string_literal)))

================================================================================
String with escaped backtick
================================================================================

var := "line1``line2"

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (string_literal)))

================================================================================
Empty double-quoted string
================================================================================

var := ""

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (string_literal)))

================================================================================
Empty single-quoted string
================================================================================

var := ''

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (string_literal)))

================================================================================
Boolean true lowercase
================================================================================

var := true

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (boolean_literal)))

================================================================================
Boolean true uppercase
================================================================================

var := TRUE

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (boolean_literal)))

================================================================================
Boolean false mixed case
================================================================================

var := False

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (boolean_literal)))

================================================================================
Unset literal
================================================================================

var := unset

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (unset)))

================================================================================
Empty array literal
================================================================================

var := []

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (array_literal)))

================================================================================
Array literal with string literals
================================================================================

var := ["one", "two", "three"]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (array_literal
      (expression_sequence
        (string_literal)
        (string_literal)
        (string_literal)))))

================================================================================
Array literal with expressions
================================================================================

var := [
    one := 1,
    two := 2,
    (a := 3 + 3, a + 3)
]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (array_literal
      (expression_sequence
        (assignment_operation
          (identifier)
          (assignment_operator)
          (integer_literal))
        (assignment_operation
          (identifier)
          (assignment_operator)
          (integer_literal))
        (expression_sequence
          (assignment_operation
            (identifier)
            (assignment_operator)
            (additive_operation
              (integer_literal)
              (integer_literal)))
          (additive_operation
            (identifier)
            (integer_literal)))))))

================================================================================
Array literal with numbers
================================================================================

var := [1, 2, 3]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (array_literal
      (expression_sequence
        (integer_literal)
        (integer_literal)
        (integer_literal)))))

================================================================================
Array literal with object literals
================================================================================

var := [
  { one: "one" },
  { two: "two"}
]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (array_literal
      (expression_sequence
        (object_literal
          (object_literal_member_sequence
            (object_literal_member
              (identifier)
              (string_literal))))
        (object_literal
          (object_literal_member_sequence
            (object_literal_member
              (identifier)
              (string_literal))))))))

================================================================================
Empty object literal
================================================================================

obj := {}

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (object_literal)))

================================================================================
Object literal with simple member
================================================================================

obj := { one: 1 }

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (object_literal
      (object_literal_member_sequence
        (object_literal_member
          (identifier)
          (integer_literal))))))

================================================================================
Object literal with dynamic identifier member
================================================================================

obj := { %var%: "test"}

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (object_literal
      (object_literal_member_sequence
        (object_literal_member
          (dynamic_identifier
            (dereference_operation
              (identifier)))
          (string_literal))))))

================================================================================
Object literal with complex dynamic identifier member
================================================================================

obj := { %var%key%var2%: "test"}

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (object_literal
      (object_literal_member_sequence
        (object_literal_member
          (dynamic_identifier
            (dereference_operation
              (identifier))
            (identifier)
            (dereference_operation
              (identifier)))
          (string_literal))))))

================================================================================
Object literal with multiple members
================================================================================

obj := { 
  one: 1,
  two: "two"
}

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (object_literal
      (object_literal_member_sequence
        (object_literal_member
          (identifier)
          (integer_literal))
        (object_literal_member
          (identifier)
          (string_literal))))))

================================================================================
Object literal with expression member
================================================================================

obj := { 
  one: 1,
  two: "2",
  three: (a := 1, b := 2, a + b)
}

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (object_literal
      (object_literal_member_sequence
        (object_literal_member
          (identifier)
          (integer_literal))
        (object_literal_member
          (identifier)
          (string_literal))
        (object_literal_member
          (identifier)
          (expression_sequence
            (assignment_operation
              (identifier)
              (assignment_operator)
              (integer_literal))
            (assignment_operation
              (identifier)
              (assignment_operator)
              (integer_literal))
            (additive_operation
              (identifier)
              (identifier))))))))

================================================================================
Object literal with array
================================================================================

obj := { emptyArr: [] }

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (object_literal
      (object_literal_member_sequence
        (object_literal_member
          (identifier)
          (array_literal))))))

================================================================================
Object literal with fat-arrow function member
================================================================================

obj := { Add: (self, left, right) => left + right }

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (object_literal
      (object_literal_member_sequence
        (object_literal_member
          (identifier)
          (fat_arrow_function
            (function_head
              (param_sequence
                (identifier)
                (identifier)
                (identifier)))
            (arrow)
            (additive_operation
              (identifier)
              (identifier))))))))

================================================================================
Object literal multiline with fat-arrow function members
================================================================================

obj := { 
  Add: (self, left, right) => left + right,
  Subtract: (self, left, right) => left - right
}

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (object_literal
      (object_literal_member_sequence
        (object_literal_member
          (identifier)
          (fat_arrow_function
            (function_head
              (param_sequence
                (identifier)
                (identifier)
                (identifier)))
            (arrow)
            (additive_operation
              (identifier)
              (identifier))))
        (object_literal_member
          (identifier)
          (fat_arrow_function
            (function_head
              (param_sequence
                (identifier)
                (identifier)
                (identifier)))
            (arrow)
            (additive_operation
              (identifier)
              (identifier))))))))

================================================================================
Nested object literals
================================================================================

obj := { 
  __Class: "Object",
  
  nested: { 
    __Class: "Nested",
    meaningOfLife: 42
  } 
}

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (object_literal
      (object_literal_member_sequence
        (object_literal_member
          (identifier)
          (string_literal))
        (object_literal_member
          (identifier)
          (object_literal
            (object_literal_member_sequence
              (object_literal_member
                (identifier)
                (string_literal))
              (object_literal_member
                (identifier)
                (integer_literal)))))))))

================================================================================
Object literal with trailing comma
================================================================================

obj := { prop: "value", }

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (object_literal
      (object_literal_member_sequence
        (object_literal_member
          (identifier)
          (string_literal))))))

================================================================================
Object literal with trailing comma multiline
================================================================================

obj := { 
  prop1: "value",
  prop2: 42,
}

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (object_literal
      (object_literal_member_sequence
        (object_literal_member
          (identifier)
          (string_literal))
        (object_literal_member
          (identifier)
          (integer_literal))))))
