================================================================================
Integer literal
================================================================================

42

--------------------------------------------------------------------------------

(source_file
  (float_literal))

================================================================================
Negative integer
================================================================================

-42

--------------------------------------------------------------------------------

(source_file
  (float_literal))

================================================================================
Float literal
================================================================================

3.14

--------------------------------------------------------------------------------

(source_file
  (float_literal))

================================================================================
Hex literal
================================================================================

0xFF00

--------------------------------------------------------------------------------

(source_file
  (hex_literal))

================================================================================
Double-quoted string
================================================================================

"hello world"

--------------------------------------------------------------------------------

(source_file
  (string_literal))

================================================================================
Single-quoted string
================================================================================

'hello world'

--------------------------------------------------------------------------------

(source_file
  (string_literal))

================================================================================
String with single quotes inside double quotes
================================================================================

"un 'quote' d"

--------------------------------------------------------------------------------

(source_file
  (string_literal))

================================================================================
String with double quotes inside single quotes
================================================================================

'outer "double quoted" outer'

--------------------------------------------------------------------------------

(source_file
  (string_literal))

================================================================================
String with nested single quotes
================================================================================

"she said 'hello' to me"

--------------------------------------------------------------------------------

(source_file
  (string_literal))

================================================================================
String with escape sequence
================================================================================

"line1`nline2"

--------------------------------------------------------------------------------

(source_file
  (string_literal))

================================================================================
String with unused escape sequence
================================================================================

"line1` line2"

--------------------------------------------------------------------------------

(source_file
  (string_literal))

================================================================================
String with escaped backtick
================================================================================

"line1``line2"

--------------------------------------------------------------------------------

(source_file
  (string_literal))

================================================================================
Empty double-quoted string
================================================================================

""

--------------------------------------------------------------------------------

(source_file
  (string_literal))

================================================================================
Empty single-quoted string
================================================================================

''

--------------------------------------------------------------------------------

(source_file
  (string_literal))

================================================================================
Boolean true lowercase
================================================================================

true

--------------------------------------------------------------------------------

(source_file
  (boolean_literal))

================================================================================
Boolean true uppercase
================================================================================

TRUE

--------------------------------------------------------------------------------

(source_file
  (boolean_literal))

================================================================================
Boolean false mixed case
================================================================================

False

--------------------------------------------------------------------------------

(source_file
  (boolean_literal))

================================================================================
Unset literal
================================================================================

unset

--------------------------------------------------------------------------------

(source_file
  (unset))

================================================================================
Empty array literal
================================================================================

[]

--------------------------------------------------------------------------------

(source_file
  (array_literal))

================================================================================
Array literal with string literals
================================================================================

["one", "two", "three"]

--------------------------------------------------------------------------------

(source_file
  (array_literal
    (expression_sequence
      (string_literal)
      (string_literal)
      (string_literal))))

================================================================================
Array literal with expressions
================================================================================

[
    one := 1,
    two := 2,
    (a := 3 + 3, a + 3)
]

--------------------------------------------------------------------------------

(source_file
  (array_literal
    (expression_sequence
      (assignment_operation
        (identifier)
        (assignment_operator)
        (integer_literal))
      (assignment_operation
        (identifier)
        (assignment_operator)
        (integer_literal))
      (expression_sequence
        (assignment_operation
          (identifier)
          (assignment_operator)
          (additive_operation
            (integer_literal)
            (integer_literal)))
        (additive_operation
          (identifier)
          (integer_literal))))))

================================================================================
Array literal with numbers
================================================================================

[1, 2, 3]

--------------------------------------------------------------------------------

(source_file
  (array_literal
    (expression_sequence
      (integer_literal)
      (integer_literal)
      (integer_literal))))

================================================================================
Array literal with object literals
================================================================================

[
  { one: "one" },
  { two: "two"}
]

--------------------------------------------------------------------------------

(source_file
  (array_literal
    (expression_sequence
      (object_literal
        (object_literal_member_sequence
          (object_literal_member
            (identifier)
            (string_literal))))
      (object_literal
        (object_literal_member_sequence
          (object_literal_member
            (identifier)
            (string_literal)))))))

================================================================================
Empty object literal
================================================================================

obj := {}

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (object_literal)))

================================================================================
Object literal with simple member
================================================================================

obj := { one: 1 }

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (object_literal
      (object_literal_member_sequence
        (object_literal_member
          (identifier)
          (integer_literal))))))

================================================================================
Object literal with multiple members
================================================================================

obj := { 
  one: 1,
  two: "two"
}

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (object_literal
      (object_literal_member_sequence
        (object_literal_member
          (identifier)
          (integer_literal))
        (object_literal_member
          (identifier)
          (string_literal))))))

================================================================================
Object literal with expression member
================================================================================

obj := { 
  one: 1,
  two: "2",
  three: (a := 1, b := 2, a + b)
}

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (object_literal
      (object_literal_member_sequence
        (object_literal_member
          (identifier)
          (integer_literal))
        (object_literal_member
          (identifier)
          (string_literal))
        (object_literal_member
          (identifier)
          (expression_sequence
            (assignment_operation
              (identifier)
              (assignment_operator)
              (integer_literal))
            (assignment_operation
              (identifier)
              (assignment_operator)
              (integer_literal))
            (additive_operation
              (identifier)
              (identifier))))))))

================================================================================
Object literal with array
================================================================================

obj := { emptyArr: [] }

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (object_literal
      (object_literal_member_sequence
        (object_literal_member
          (identifier)
          (array_literal))))))

================================================================================
Object literal with fat-arrow function member
================================================================================

obj := { Add: (self, left, right) => left + right }

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (object_literal
      (object_literal_member_sequence
        (object_literal_member
          (identifier)
          (fat_arrow_function
            (function_head
              (param_sequence
                (identifier)
                (identifier)
                (identifier)))
            (arrow)
            (additive_operation
              (identifier)
              (identifier))))))))

================================================================================
Object literal multiline with fat-arrow function members
================================================================================

obj := { 
  Add: (self, left, right) => left + right,
  Subtract: (self, left, right) => left - right
}

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (object_literal
      (object_literal_member_sequence
        (object_literal_member
          (identifier)
          (fat_arrow_function
            (function_head
              (param_sequence
                (identifier)
                (identifier)
                (identifier)))
            (arrow)
            (additive_operation
              (identifier)
              (identifier))))
        (object_literal_member
          (identifier)
          (fat_arrow_function
            (function_head
              (param_sequence
                (identifier)
                (identifier)
                (identifier)))
            (arrow)
            (additive_operation
              (identifier)
              (identifier))))))))

================================================================================
Nested object literals
================================================================================

obj := { 
  __Class: "Object",
  
  nested: { 
    __Class: "Nested",
    meaningOfLife: 42
  } 
}

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (object_literal
      (object_literal_member_sequence
        (object_literal_member
          (identifier)
          (string_literal))
        (object_literal_member
          (identifier)
          (object_literal
            (object_literal_member_sequence
              (object_literal_member
                (identifier)
                (string_literal))
              (object_literal_member
                (identifier)
                (float_literal)))))))))
