================================================================================
Addition operator
================================================================================

result := a + b

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (additive_operation
          (single_expression
            (identifier))
          (single_expression
            (identifier)))))))

================================================================================
Subtraction operator
================================================================================

result := a - b

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (additive_operation
          (single_expression
            (identifier))
          (single_expression
            (identifier)))))))

================================================================================
Multiplication operator
================================================================================

result := a * b

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (multiplicative_operation
          (single_expression
            (identifier))
          (single_expression
            (identifier)))))))

================================================================================
Division operator
================================================================================

result := a / b

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (multiplicative_operation
          (single_expression
            (identifier))
          (single_expression
            (identifier)))))))

================================================================================
Floor division operator
================================================================================

result := a // b

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (multiplicative_operation
          (single_expression
            (identifier))
          (single_expression
            (identifier)))))))

================================================================================
Is comparison
================================================================================

result := a is b

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (type_check_operation
          (single_expression
            (identifier))
          (single_expression
            (identifier)))))))

================================================================================
Logical AND double ampersand
================================================================================

result := a && b

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (logical_and_operation
          (single_expression
            (identifier))
          (single_expression
            (identifier)))))))

================================================================================
Logical AND word
================================================================================

result := a and b

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (logical_and_operation
          (single_expression
            (identifier))
          (single_expression
            (identifier)))))))

================================================================================
Logical OR double pipe
================================================================================

result := a || b

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (logical_or_operation
          (single_expression
            (identifier))
          (single_expression
            (identifier)))))))

================================================================================
Logical OR word
================================================================================

result := a or b

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (logical_or_operation
          (single_expression
            (identifier))
          (single_expression
            (identifier)))))))

================================================================================
Bitwise AND
================================================================================

result := a & b

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (bitwise_and_operation
          (single_expression
            (identifier))
          (single_expression
            (identifier)))))))

================================================================================
Bitwise XOR
================================================================================

result := a ^ b

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (bitwise_xor_operation
          (single_expression
            (identifier))
          (single_expression
            (identifier)))))))

================================================================================
Bit shift left
================================================================================

result := a << b

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (bitshift_operation
          (single_expression
            (identifier))
          (bitshift_operator)
          (single_expression
            (identifier)))))))

================================================================================
Arithmetic bit shift right
================================================================================

result := a >> b

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (bitshift_operation
          (single_expression
            (identifier))
          (bitshift_operator)
          (single_expression
            (identifier)))))))

================================================================================
Logical bit shift right
================================================================================

result := a >>> b

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (bitshift_operation
          (single_expression
            (identifier))
          (bitshift_operator)
          (single_expression
            (identifier)))))))

================================================================================
Explicit concatenation
================================================================================

result := a . b

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (explicit_concat_operation
          (single_expression
            (identifier))
          (single_expression
            (identifier)))))))

================================================================================
Exponentiation operator
================================================================================

result := a ** b

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (exponent_operation
          (single_expression
            (identifier))
          (single_expression
            (identifier)))))))

================================================================================
Dereference operator
================================================================================

result := %"var"%

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (dereference_operation
          (single_expression
            (literal
              (string_literal))))))))

================================================================================
VarRef operator
================================================================================

ref := &var

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (varref_operation
          (single_expression
            (identifier)))))))

================================================================================
VarRef operator with bitwise AND
================================================================================

ref := & var1 & var2

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (identifier))
      (assignment_operator)
      (single_expression
        (bitwise_and_operation
          (single_expression
            (varref_operation
              (single_expression
                (identifier))))
          (single_expression
            (identifier)))))))

================================================================================
Prefix increment
================================================================================

++x

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (prefix_operation
      (identifier))))

================================================================================
Prefix decrement
================================================================================

--x

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (prefix_operation
      (identifier))))

================================================================================
Postfix increment
================================================================================

x++

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (postfix_operation
      (identifier))))

================================================================================
Postfix decrement
================================================================================

x--

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (postfix_operation
      (identifier))))

================================================================================
Regex match
================================================================================

a ~= b

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (regex_match_operation
      (single_expression
        (identifier))
      (single_expression
        (identifier)))))

================================================================================
Or-maybe operation
================================================================================

a ?? b

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (or_maybe_operation
      (single_expression
        (identifier))
      (single_expression
        (identifier)))))
