================================================================================
Addition operator
================================================================================

result := a + b

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (additive_operation
      (identifier)
      (identifier))))

================================================================================
Subtraction operator
================================================================================

result := a - b

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (additive_operation
      (identifier)
      (identifier))))

================================================================================
Multiplication operator
================================================================================

result := a * b

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (multiplicative_operation
      (identifier)
      (identifier))))

================================================================================
Division operator
================================================================================

result := a / b

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (multiplicative_operation
      (identifier)
      (identifier))))

================================================================================
Floor division operator
================================================================================

result := a // b

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (multiplicative_operation
      (identifier)
      (identifier))))

================================================================================
Is comparison
================================================================================

result := a is b

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (type_check_operation
      (identifier)
      (identifier))))

================================================================================
Logical AND double ampersand
================================================================================

result := a && b

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (logical_and_operation
      (identifier)
      (identifier))))

================================================================================
Logical AND word
================================================================================

result := a and b

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (logical_and_operation
      (identifier)
      (identifier))))

================================================================================
Logical OR double pipe
================================================================================

result := a || b

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (logical_or_operation
      (identifier)
      (identifier))))

================================================================================
Logical OR word
================================================================================

result := a or b

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (logical_or_operation
      (identifier)
      (identifier))))

================================================================================
Bitwise AND
================================================================================

result := a & b

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (bitwise_and_operation
      (identifier)
      (identifier))))

================================================================================
Bitwise XOR
================================================================================

result := a ^ b

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (bitwise_xor_operation
      (identifier)
      (identifier))))

================================================================================
Bit shift left
================================================================================

result := a << b

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (bitshift_operation
      (identifier)
      (bitshift_operator)
      (identifier))))

================================================================================
Arithmetic bit shift right
================================================================================

result := a >> b

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (bitshift_operation
      (identifier)
      (bitshift_operator)
      (identifier))))

================================================================================
Logical bit shift right
================================================================================

result := a >>> b

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (bitshift_operation
      (identifier)
      (bitshift_operator)
      (identifier))))

================================================================================
Explicit concatenation
================================================================================

result := a . b

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (explicit_concat_operation
      (identifier)
      (identifier))))

================================================================================
Exponentiation operator
================================================================================

result := a ** b

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (exponent_operation
      (identifier)
      (identifier))))

================================================================================
Dereference operator
================================================================================

result := %"var"%

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (dereference_operation
      (string_literal))))

================================================================================
VarRef operator
================================================================================

ref := &var

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (varref_operation
      (identifier))))

================================================================================
VarRef operator with bitwise AND
================================================================================

ref := & var1 & var2

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (bitwise_and_operation
      (varref_operation
        (identifier))
      (identifier))))

================================================================================
Prefix increment
================================================================================

++x

--------------------------------------------------------------------------------

(source_file
  (prefix_operation
    (identifier)))

================================================================================
Prefix decrement
================================================================================

--x

--------------------------------------------------------------------------------

(source_file
  (prefix_operation
    (identifier)))

================================================================================
Postfix increment
================================================================================

x++

--------------------------------------------------------------------------------

(source_file
  (postfix_operation
    (identifier)))

================================================================================
Postfix decrement
================================================================================

x--

--------------------------------------------------------------------------------

(source_file
  (postfix_operation
    (identifier)))

================================================================================
Regex match
================================================================================

a ~= b

--------------------------------------------------------------------------------

(source_file
  (expression_sequence
    (regex_match_operation
      (identifier)
      (identifier))))

================================================================================
Or-maybe operation
================================================================================

a ?? b

--------------------------------------------------------------------------------

(source_file
  (expression_sequence
    (or_maybe_operation
      (identifier)
      (identifier))))

================================================================================
Repeated multline explicit concatenation
================================================================================

; A real example from cJSON
codeB64 := ""
		. "G7gAVVdWU4HsbAFAAACLvCSMAWC0RCSAATCcJIQAMIkA+IhEJDMPtwYAZoP4Aw+EBgiEAAAAJBQPhEQDJBAID4SiAxIFD4QCwAMSCQ+EhgAAQACF"
		. "2w+ETgAiiwgDvV8AHIPGCI0AUB7HACIAVQBAx0AEbgBrAAwICG4AbwAGDHcAbiEABhBfAFYABhRhBABsAAYYdQBlAACJE2aJaByLhAQkiAGMXCQE"

--------------------------------------------------------------------------------

(source_file
  (line_comment)
  (assignment_operation
    (identifier)
    (assignment_operator)
    (explicit_concat_operation
      (explicit_concat_operation
        (string_literal)
        (string_literal))
      (string_literal))))

================================================================================
Subtraction with negative integer on right
================================================================================

result := 2 - -2

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (additive_operation
      (integer_literal)
      (prefix_operation
        (integer_literal)))))

================================================================================
Subtraction with negative integer on left
================================================================================

result := 2 - -2

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (additive_operation
      (integer_literal)
      (prefix_operation
        (integer_literal)))))

================================================================================
Subtraction with prefix-positive integer on right
================================================================================

result := 2 - +2

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (additive_operation
      (integer_literal)
      (prefix_operation
        (integer_literal)))))

================================================================================
Addition with negative integer on right
================================================================================

result := 2 + -2

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (additive_operation
      (integer_literal)
      (prefix_operation
        (integer_literal)))))

================================================================================
Assignment with dynamic member access
================================================================================

result.%definition.name% := validatedValue

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (member_access
      (identifier)
      (dynamic_identifier
        (dereference_operation
          (member_access
            (identifier)
            (identifier)))))
    (assignment_operator)
    (identifier)))

================================================================================
Assignment with complex dynamic member access
================================================================================

result.%definition.name%prop := validatedValue

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (member_access
      (identifier)
      (dynamic_identifier
        (dereference_operation
          (member_access
            (identifier)
            (identifier)))
        (identifier)))
    (assignment_operator)
    (identifier)))
