================================================================================
Simple ternary expression
================================================================================

str := true? "true" : "false"

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (ternary_expression
      (boolean_literal)
      (string_literal)
      (string_literal))))

================================================================================
Nested ternary expression
================================================================================

(a == 1? "one" : a == 2? "two" : "> two")

--------------------------------------------------------------------------------

(source_file
  (expression_sequence
    (ternary_expression
      (equality_operation
        (identifier)
        (integer_literal))
      (string_literal)
      (ternary_expression
        (equality_operation
          (identifier)
          (integer_literal))
        (string_literal)
        (string_literal)))))

================================================================================
Simple multiline ternary expression
================================================================================

str := val == 1?
    "true" :
    "false"

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (ternary_expression
      (equality_operation
        (identifier)
        (integer_literal))
      (string_literal)
      (string_literal))))

================================================================================
Ternary with no spaces
================================================================================

result:=a?b:c

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (ternary_expression
      (identifier)
      (identifier)
      (identifier))))

================================================================================
Ternary with arithmetic in condition
================================================================================

result := x + y > 10? "big" : "small"

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (ternary_expression
      (relational_operation
        (additive_operation
          (identifier)
          (identifier))
        (float_literal))
      (string_literal)
      (string_literal))))

================================================================================
Ternary with arithmetic in branches
================================================================================

result := flag? 1 + 2 : 3 * 4

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (ternary_expression
      (identifier)
      (additive_operation
        (integer_literal)
        (integer_literal))
      (multiplicative_operation
        (integer_literal)
        (integer_literal)))))

================================================================================
Ternary with logical operators in condition
================================================================================

result := x > 5 && y < 10? "valid" : "invalid"

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (ternary_expression
      (logical_and_operation
        (relational_operation
          (identifier)
          (integer_literal))
        (relational_operation
          (identifier)
          (float_literal)))
      (string_literal)
      (string_literal))))

================================================================================
Ternary with logical OR in condition
================================================================================

result := x || y? "truthy" : "falsy"

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (ternary_expression
      (logical_or_operation
        (identifier)
        (identifier))
      (string_literal)
      (string_literal))))

================================================================================
Nested ternary in true branch
================================================================================

a? (b? c : d) : e

--------------------------------------------------------------------------------

(source_file
  (ternary_expression
    (identifier)
    (expression_sequence
      (ternary_expression
        (identifier)
        (identifier)
        (identifier)))
    (identifier)))

================================================================================
Multiple nested ternaries
================================================================================

a? b? c : d : e? f : g

--------------------------------------------------------------------------------

(source_file
  (ternary_expression
    (identifier)
    (ternary_expression
      (identifier)
      (identifier)
      (identifier))
    (ternary_expression
      (identifier)
      (identifier)
      (identifier))))

================================================================================
Ternary in array literal
================================================================================

arr := [x > 5? "big" : "small", other]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (array_literal
      (expression_sequence
        (ternary_expression
          (relational_operation
            (identifier)
            (integer_literal))
          (string_literal)
          (string_literal))
        (identifier)))))

================================================================================
Ternary in object literal
================================================================================

obj := {value: x > 0? x : 0}

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (object_literal
      (object_literal_member_sequence
        (object_literal_member
          (identifier)
          (ternary_expression
            (relational_operation
              (identifier)
              (integer_literal))
            (identifier)
            (integer_literal)))))))

================================================================================
Ternary with prefix operators
================================================================================

result := !flag? ++x : --y

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (ternary_expression
      (prefix_operation
        (identifier))
      (prefix_operation
        (identifier))
      (prefix_operation
        (identifier)))))

================================================================================
Ternary with postfix operators
================================================================================

result := flag? x++ : y--

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (ternary_expression
      (identifier)
      (postfix_operation
        (identifier))
      (postfix_operation
        (identifier)))))

================================================================================
Ternary with unary operators in branches
================================================================================

result := condition? -value : +value

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (ternary_expression
      (identifier)
      (prefix_operation
        (identifier))
      (prefix_operation
        (identifier)))))

================================================================================
Ternary with bitwise operators
================================================================================

result := flag? a & b : c | d

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (ternary_expression
      (identifier)
      (bitwise_and_operation
        (identifier)
        (identifier))
      (bitwise_or_operation
        (identifier)
        (identifier)))))

================================================================================
Ternary result used in arithmetic
================================================================================

result := 10 + (x? 5 : 3)

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (additive_operation
      (float_literal)
      (expression_sequence
        (ternary_expression
          (identifier)
          (integer_literal)
          (integer_literal))))))

================================================================================
Parenthesized ternary as condition
================================================================================

(a? b : c)? d : e

--------------------------------------------------------------------------------

(source_file
  (ternary_expression
    (expression_sequence
      (ternary_expression
        (identifier)
        (identifier)
        (identifier)))
    (identifier)
    (identifier)))

================================================================================
Ternary with comma operator
================================================================================

a? b : c, d

--------------------------------------------------------------------------------

(source_file
  (expression_sequence
    (ternary_expression
      (identifier)
      (identifier)
      (identifier))
    (identifier)))

================================================================================
Multiple ternaries with comma
================================================================================

a? b : c, x? y : z

--------------------------------------------------------------------------------

(source_file
  (expression_sequence
    (ternary_expression
      (identifier)
      (identifier)
      (identifier))
    (ternary_expression
      (identifier)
      (identifier)
      (identifier))))

================================================================================
Ternary with verbal NOT operator
================================================================================

result := not condition? "A" : "B"

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (ternary_expression
      (verbal_not_operation
        (identifier))
      (string_literal)
      (string_literal))))

================================================================================
Ternary with array literals in branches
================================================================================

result := flag? [1, 2, 3] : [4, 5, 6]

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (ternary_expression
      (identifier)
      (array_literal
        (expression_sequence
          (integer_literal)
          (integer_literal)
          (integer_literal)))
      (array_literal
        (expression_sequence
          (integer_literal)
          (integer_literal)
          (integer_literal))))))

================================================================================
Ternary with object literals in branches
================================================================================

result := flag? {x: 1} : {y: 2}

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (ternary_expression
      (identifier)
      (object_literal
        (object_literal_member_sequence
          (object_literal_member
            (identifier)
            (integer_literal))))
      (object_literal
        (object_literal_member_sequence
          (object_literal_member
            (identifier)
            (integer_literal)))))))

================================================================================
Complex nested ternary with mixed operators
================================================================================

result := (x > 5 && y < 10)? (z := a + b) : (w := c * d)

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (ternary_expression
      (expression_sequence
        (logical_and_operation
          (relational_operation
            (identifier)
            (integer_literal))
          (relational_operation
            (identifier)
            (float_literal))))
      (expression_sequence
        (assignment_operation
          (identifier)
          (assignment_operator)
          (additive_operation
            (identifier)
            (identifier))))
      (expression_sequence
        (assignment_operation
          (identifier)
          (assignment_operator)
          (multiplicative_operation
            (identifier)
            (identifier)))))))

================================================================================
Ternary with bitshift operators
================================================================================

result := flag? value << 2 : value >> 1

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (ternary_expression
      (identifier)
      (bitshift_operation
        (identifier)
        (bitshift_operator)
        (integer_literal))
      (bitshift_operation
        (identifier)
        (bitshift_operator)
        (integer_literal)))))

================================================================================
Ternary with exponent operator
================================================================================

result := flag? x ** 2 : y ** 3

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (ternary_expression
      (identifier)
      (exponent_operation
        (identifier)
        (integer_literal))
      (exponent_operation
        (identifier)
        (integer_literal)))))

================================================================================
Ternary with explicit concatenation
================================================================================

result := flag? "Hello" . " World" : "Goodbye"

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (ternary_expression
      (identifier)
      (explicit_concat_operation
        (string_literal)
        (string_literal))
      (string_literal))))

================================================================================
Deeply nested ternary (4 levels)
================================================================================

a? b? c? d : e : f? g : h : i? j : k

--------------------------------------------------------------------------------

(source_file
  (ternary_expression
    (identifier)
    (ternary_expression
      (identifier)
      (ternary_expression
        (identifier)
        (identifier)
        (identifier))
      (ternary_expression
        (identifier)
        (identifier)
        (identifier)))
    (ternary_expression
      (identifier)
      (identifier)
      (identifier))))

================================================================================
Ternary with compound assignment in branches
================================================================================

flag? x += 1 : y -= 1

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (ternary_expression
      (identifier)
      (assignment_operation
        (identifier)
        (assignment_operator)
        (integer_literal))
      (identifier))
    (assignment_operator)
    (integer_literal)))

================================================================================
Ternary with or-maybe on one side
================================================================================

flag? a : b ?? c

--------------------------------------------------------------------------------

(source_file
  (ternary_expression
    (identifier)
    (identifier)
    (or_maybe_operation
      (identifier)
      (identifier))))

================================================================================
Ternary with or-maybe on both sides
================================================================================

flag? a ?? b : c ?? d

--------------------------------------------------------------------------------

(source_file
  (ternary_expression
    (identifier)
    (or_maybe_operation
      (identifier)
      (identifier))
    (or_maybe_operation
      (identifier)
      (identifier))))

================================================================================
Or-maybe with ternary expression
================================================================================

var := a ?? b ? c : d

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (ternary_expression
      (or_maybe_operation
        (identifier)
        (identifier))
      (identifier)
      (identifier))))
