================================================================================
Simple identifier
================================================================================

myVar

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (identifier)))

================================================================================
Case insensitive identifier uppercase
================================================================================

global ONE := 1

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (variable_declaration
          (scope_identifier)
          (identifier)))
      (assignment_operator)
      (single_expression
        (literal
          (numeric_literal))))))

================================================================================
Case insensitive identifier mixed case
================================================================================

global oNE := 1

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (variable_declaration
          (scope_identifier)
          (identifier)))
      (assignment_operator)
      (single_expression
        (literal
          (numeric_literal))))))

================================================================================
Global variable declaration
================================================================================

global myGlobal

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (variable_declaration
      (scope_identifier)
      (identifier))))

================================================================================
Global declaration uppercase
================================================================================

GLOBAL myGlobal

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (variable_declaration
      (scope_identifier)
      (identifier))))

================================================================================
Local variable declaration
================================================================================

local myLocal

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (variable_declaration
      (scope_identifier)
      (identifier))))

================================================================================
Local declaration mixed case
================================================================================

LocAL myLocal

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (variable_declaration
      (scope_identifier)
      (identifier))))

================================================================================
Static variable declaration
================================================================================

static myStatic

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (variable_declaration
      (scope_identifier)
      (identifier))))

================================================================================
Static declaration uppercase
================================================================================

STATIC myStatic

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (variable_declaration
      (scope_identifier)
      (identifier))))

================================================================================
Identifier with underscore
================================================================================

_privateVar

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (identifier)))

================================================================================
Identifier with numbers
================================================================================

var123

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (identifier)))

================================================================================
VarRef with initializer
================================================================================

&ref := 123

--------------------------------------------------------------------------------

(source_file
  (single_expression
    (assignment_operation
      (single_expression
        (varref_operation
          (single_expression
            (identifier))))
      (assignment_operator)
      (single_expression
        (literal
          (numeric_literal))))))
