================================================================================
Case insensitive identifier uppercase
================================================================================

global ONE := 1

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (variable_declaration
      (scope_identifier)
      (identifier))
    (assignment_operator)
    (integer_literal)))

================================================================================
Case insensitive identifier mixed case
================================================================================

global oNE := 1

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (variable_declaration
      (scope_identifier)
      (identifier))
    (assignment_operator)
    (integer_literal)))

================================================================================
Global variable declaration
================================================================================

global myGlobal

--------------------------------------------------------------------------------

(source_file
  (variable_declaration
    (scope_identifier)
    (identifier)))

================================================================================
Global declaration uppercase
================================================================================

GLOBAL myGlobal

--------------------------------------------------------------------------------

(source_file
  (variable_declaration
    (scope_identifier)
    (identifier)))

================================================================================
Local variable declaration
================================================================================

local myLocal

--------------------------------------------------------------------------------

(source_file
  (variable_declaration
    (scope_identifier)
    (identifier)))

================================================================================
Local declaration mixed case
================================================================================

LocAL myLocal

--------------------------------------------------------------------------------

(source_file
  (variable_declaration
    (scope_identifier)
    (identifier)))

================================================================================
Static variable declaration
================================================================================

static myStatic

--------------------------------------------------------------------------------

(source_file
  (variable_declaration
    (scope_identifier)
    (identifier)))

================================================================================
Static declaration uppercase
================================================================================

STATIC myStatic

--------------------------------------------------------------------------------

(source_file
  (variable_declaration
    (scope_identifier)
    (identifier)))

================================================================================
Identifier with underscore
================================================================================

_privateVar := 0

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (integer_literal)))

================================================================================
Identifier with numbers
================================================================================

var123 := 321

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (identifier)
    (assignment_operator)
    (float_literal)))

================================================================================
VarRef with initializer
================================================================================

&ref := 123

--------------------------------------------------------------------------------

(source_file
  (assignment_operation
    (varref_operation
      (identifier))
    (assignment_operator)
    (float_literal)))
